{  "terms": [{"id":"6816905339","term":"A candidate may apply to multiple jobs at the company Universal Container by submitting a single application per job posting. Once an application submitted for a job posting, that application cannot be modified to be resubmitted to a different job posting.\n\nWhat can the administrator do to associate an application with each job posting in the schema for the organization?\n\nA. Create a lookup relationship on both objects to a junction object called Job Posting Applications.\nB. Create a master-detail relationship in the Job Posting custom object to the Applications custom object.\nC. Create a master-detail relationship in the Applications custom object to the Job Posting custom object.\nD. Create a lookup relationship in the Applications custom object to the Job Posting custom object.","definition":"C. Create a master-detail relationship in the Applications custom object to the Job Posting custom object.","rank":14},{"id":"8089141440","term":"A candidate may apply to multiple jobs at the company Universal Containers by submitting a single application per job posting, that application cannot be modified to be resubmitted to a different job posting.\nWhat can the administrator do to associate an application with each job posting in the schema for the organization?\nA. Create a lookup relationship on both objects to a junction object called Job Posting Applications.\nB. Create a master-detail relationship in the Job Postings custom object to the Applications custom object.\nC. Create a master-detail relationship in the Application custom object to the Job Postings custom object.\nD. Create a lookup relationship in the Applications custom object to the Job Postings custom object.","definition":"C. Create a master-detail relationship in the Application custom object to the Job Postings custom object.","rank":15},{"id":"8109551231","term":"A candidate may apply to multiple jobs at the company Universal Containers by submitting a single application per job posting. Once an application is submitted for a job posting, that application cannot be modified to be resubmitted for another job position. The candidate can apply for a different job posting only by submitting a new application. What can an administrator do to associate an application with each job posting in the schema for the organization?\n\nA. Create a master-detail relationship in the Application custom object to the Job Postings custom object\nB. Create a master-detail relationship in the Job Postings custom object to the Applications customer object\nC. Create a lookup relationship on both objects to a junction object called Job Posting Applications\nD. Create a lookup relationship in the Applications customer object to the Job Postings custom object","definition":"A. Create a master-detail relationship in the Application custom object to the Job Postings custom object","rank":129},{"id":"4714617699","term":"Access control is defined independently of objects that have a Lookup relationship.\n\nA. False\nB. True","definition":"B","rank":19},{"id":"4714614849","term":"Access control is defined independently of objects that have a Master-Detail relationship.\n\nA. False\nB. True","definition":"A","rank":15},{"id":"8089124110","term":"A company has a custom object named Warehouse. Each Warehouse record has a distinct record owner, and is related to a parent Account in Salesforce.\nWhich kind of relationship would a developer use to relate the Account to the Warehouse?\n\nA. One-to-Many \nB. Lookup\nC. Master-Detail \nD. Parent-Child","definition":"B","rank":9},{"id":"8109108236","term":"A company has a custom object named Warehouse. Each Warehouse record has a distinct record owner, and is related to a parent Account in Salesforce. [What kind of relationship exists?]\n\nA. One-to-Many\nB. Lookup\nC. Master-Detail\nD. Parent-Child","definition":"B. Lookup","rank":31},{"id":"6816792348","term":"A company has a custom object named Warehouse. Each Warehouse record has a distinct record owner, and is related to parent Account in Salesforce.\n\nWhich kind of relationship would the developer use to relate the Account to the warehouse?\n\nA. One-to-Many\nB. Lookup\nC. Master-Detail\nD. Parent-Child","definition":"B. Lookup","rank":8},{"id":"8109750908","term":"A company that uses a custom object to track candidates would like to send candidate information automatically to a third-party human resources system when a candidate is hired. What can a developer do to accomplish this task?\n\nA. Create an escalation rule to the hiring manager\nB. Create a Process Builder with an outbound message action\nC. Create an auto-response rule to the candidate\nD. Create a workflow rule with an outbound message action","definition":"D. Create a workflow rule with an outbound message action","rank":151},{"id":"8089710118","term":"A company that uses a Custom object to track candidates would like to send candidate information automatically to a third -party human resource system when a candidate is hired.\nWhat can a developer do to accomplish this task?\nA. Create an escalation rule to the hiring manager.\nB. Create an auto response rule to the candidate.\nC. Create a Process Builder with an outbound message action. \nD. Create a workflow rule with an outbound message action.","definition":"D. Create a workflow rule with an outbound message action.","rank":24},{"id":"6816963366","term":"A company that uses a custom object to track candidate would like to send candidate information automatically to a third-party human resource system when a candidate is hired.\n\nWhat can a developer do to accomplish this task?\n\nA. Create an escalation rule to the hiring manager\nB. Create an auto response rule to the candidate\nC. Create a Process Builder with an outbound message action\nD. Create a workflow rule with an outbound message action","definition":"D. Create a workflow rule with an outbound message action","rank":24},{"id":"6816959254","term":"A company that uses a custom object to track candidate would like to send candidate information automatically to a third-party human resource system when a candidate is hired.\nWhat can a developer do to accomplish this task?\n\nA. Create an escalation rule to the hiring manager\nB. Create an auto response rule to the candidate\nC. Create a Process Builder with an outbound message action\nD. Create a workflow rule with an outbound message action","definition":"D. Create a workflow rule with an outbound message action","rank":23},{"id":"6824413964","term":"A company wants a recruiting app that models candidates and interviews; displays the total number of interviews each candidate record; and defines security on interview records that is independent from the security candidate records.\n\nWhat would a developer do to accomplish this task? Choose 2 answers.\n\nA. Create a roll-up summary field on the Candidate object that counts Interview records.\nB. Create a master-detail relationship between the Candidate and Interview objects.\nC. Create a lookup relationship between the Candidate and Interview objects.\nD. Create a trigger on the Interview object that updates a field on the Candidate object.","definition":"C. Create a lookup relationship between the Candidate and Interview objects.\nD. Create a trigger on the Interview object that updates a field on the Candidate object.","rank":65},{"id":"8090062040","term":"A company wants a recruiting app that models candidates and interviews; displays the total number of interviews each candidate record; and defines security on interview records that is independent from the security on candidate records.\nWhat would a developer do to accomplish this task? Choose 2 answers\nA. Create a roll -up summary field on the Candidate object that counts Interview records.\nB. Create a master -detail relationship between the Candidate and Interview objects.\nC. Create a lookup relationship between the Candidate and Interview objects.\nD. Create a trigger on the Interview object that updates a field on the Candidate object.","definition":"C. Create a lookup relationship between the Candidate and Interview objects.\nD. Create a trigger on the Interview object that updates a field on the Candidate object.","rank":66},{"id":"8109779018","term":"A company wants a recruiting app that models candidates and interviews; displays the total number of interviews on each candidate record; and defines security on interview records that is independent from the security on candidate records.What would a developer do to accomplish this task?\n\nA. Create a lookup relationship between the Candidate and Interview objects.\nB. Create a trigger on the Interview object that updates a field on the Candidate object\nC. Create a roll-up summary field on the Candidate object that counts Interview records.\nD. Create a master-detail relationship between the Candidate and Interview objects.","definition":"A. Create a lookup relationship between the Candidate and Interview objects.\nB. Create a trigger on the Interview object that updates a field on the Candidate object","rank":157},{"id":"8090427963","term":"Actions on a Lightning Page allow you to do which of the following?\nA. Send email and delete or clone records.\nB. Send email, create a task, and create or update records. \nC. Clone records, add users, and assign permissions.\nD. Send email, send outbound messages, and launch a flow.","definition":"B. Send email, create a task, and create or update records.","rank":174},{"id":"8109546853","term":"A customer wants to add a custom validation to the \"contact save\" process. Before a contact is created, the customer wants to include the validation, which checks if the associated account is active. This validation should be active for all UI as well as integration requests. Which design accomplishes this goal?\n\nA. A custom Web service\nB. A \"before insert\" Trigger\nC. A custom Visualforce controller\nD. A client-side S-control","definition":"B. A \"before insert\" Trigger","rank":127},{"id":"8089765228","term":"A custom exception \"RecordNotFoundException\" is defined by the following code of block.\npublic class RecordNotFoundException extends Exception() which statement can a developer use to throw a custom exception?\nchoose 2 answers\nA. throw new RecordNotFoundException(\"problem occured\"); \nB. throw new RecordNotFoundException();\nC. throw RecordNotFoundException(\"problem occured\");\nD. throw RecordNotFoundException();","definition":"A. throw new RecordNotFoundException(\"problem occured\"); \nB. throw new RecordNotFoundException();","rank":34},{"id":"6817014013","term":"A custom exception named \"RecordNotFoundException\" is defined by the following code block.\npublic class RecordNotFoundException extends Exception {}\n\nWhich statement can a developer use to throw the custom exception? Choose 2 answers\n\nA. throw new RecordNotFoundException(\"Problem occurred\");\nB. throw new RecordNotFoundException();\nC. thow RecordNotFoundException(\"Problem occurred\");\nD. throw RecordNotFoundException();","definition":"A. throw new RecordNotFoundException(\"Problem occurred\");\nB. throw new RecordNotFoundException();","rank":34},{"id":"8109400469","term":"A custom exception named \"RecordNotFoundException\" is defined by the following code block:\n\npublic class RecordNotFoundException extends Exception {\n}\n\nWhich statement can a developer use to throw the custom exception? Choose 2\n\nA. Throw RecordNotFoundException();\nB. Throw RecordNotFoundException(\u0027Problem ocurred\u0027)\nC. Throw new RecordNotFoundException(\u0027Problem occurred\u0027)\nD. Throw new RecordNotFoundException();","definition":"C. Throw new RecordNotFoundException(\u0027Problem occurred\u0027)\nD. Throw new RecordNotFoundException();","rank":81},{"id":"4714605928","term":"A custom object contains employee salary and other employee information. The HR Manager may see all information about the employee. However, the HR Administrator should not see the salary. What settings would you use to accomplish this?\n\nA. Record Types\nB. Organization Wide Defaults\nC. Page Layouts\nD. Sharing Rules\nE. Field Level Security","definition":"E","rank":11},{"id":"8109539377","term":"A custom object has an organization-wide default setting of \"Private\" with Grant Access Using Hierarchies turned off. Which users can select the Sharing button on records for that object?\n\nA. Only the record owner and a user with the System Administrator profile\nB. The record owner, a user with the System Administrator profile, and a user shared to the record\nC. The record owner, a user shared to the record, any user above the record owner in the role hierarchy, and a user with the System Administrator profile\nD. The record owner, a user above the record owner in the role hierarchy, and a user with the System","definition":"B. The record owner, a user with the System Administrator profile, and a user shared to the record","rank":124},{"id":"8089154998","term":"A developer created an Apex trigger using the Developer Console and now wants to debug code\nHow can the developer accomplish this in the Developer Console?\nA. Select the Override Log Triggers checkbox for the trigger \nB. Add the user name in the Log Inspector.\nC. Open the Progress tab in the Developer Console.\nD. Open the logs tab in the Developer Console.","definition":"D. Open the logs tab in the Developer Console.","rank":19},{"id":"8090179147","term":"A developer created an Apex trigger using the Developer Console and now wants to debug code.\nHow can the developer accomplish this in the Developer Console?\nA. Open the Logs tab in the Developer Console.\nB. Select the Override Log Triggers checkbox for the trigger. \nC. Add the user name in the Log Inspector.\nD. Open the Progress tab in the Developer Console.","definition":"A. Open the Logs tab in the Developer Console.","rank":105},{"id":"8109092539","term":"A developer created an apex Trigger using the Developer Console and now wants to debug code. How can a developer accomplish this in the Developer console?\n\nA. Select the Override Log Triggers checkbox for the trigger\nB. Add the user name to the Log Inspector\nC. Open the Progress tab in the Developer Console\nD. Open the Logs tab in the Developer Console","definition":"D. Open the Logs tab in the Developer Console","rank":27},{"id":"8090382664","term":"A developer created trigger with following code ,\nlist\u003cAccount\u003e lstAccounts \u003d new list\u003cAccount\u003e();\nfor(order__c objorder:trigger.new){\naccount a \u003d [select id from Account where id\u003d:objorder.Account__c]; lstAccounts .add(a);\n}\nupdate lstAccounts;\nHow many order will be load when developer attempts to load 150 records?\nA. 0 \nB. 1 \nC. 100 \nD. 150","definition":"A.0","rank":157},{"id":"8109385601","term":"A developer created trigger with following code:\n\nlist\u003cAccount\u003e lstAccounts \u003d new list\u003cAccount\u003e();\nfor(order__c objorder:trigger.new){\naccount a \u003d [select id from Account where id\u003d:objorder.Account__c];\nlstAccounts .add(a);\n}\nupdate lstAccounts;\n\nHow many order will be load when developer attempts to load 150 records.\n\nA. 0\nB. 150\nC. 100\nD. 1","definition":"A. 0","rank":75},{"id":"8109795842","term":"A developer creates a custom controller and custom Visualforce page by using the following code block.\n\npublic class myController {\n public String myString;\n \n public String getMyString() {\n return \u0027getMyString\u0027;\n }\n public String getStringMethod1() {\n return myString;\n }\n public String getStringMethod2(){\n if (myString \u003d\u003d null) \n myString \u003d \u0027Method2\u0027;\n return myString;\n }\n}\n\n\u003capex:page controller\u003d\"myController\"\u003e\n {!myString}, {!StringMethod1}, {!StringMethod2}, {!myString}\n\u003c/apex:page\u003e\n\nA. ,, Method2,\nB. getMyString, ,Method2, getMyString\nC. , , Method2, getMyString\nD. getMySting","definition":"A. ,, Method2,","rank":162},{"id":"6922396990","term":"A developer creates a method in an Apex class and needs to ensure that errors are\nhandled properly. Which three would the developer use?\nChoose three answers\nA. ApexPages.addErrorMessage()\nB. A custom exception\nC. .addError()\nD. Database.handleException()\nE. A try/catch construct","definition":"B, C, E","rank":110},{"id":"8109838409","term":"A developer creates a method in an Apex class and needs to ensure that errors are handled properly. What would the developer use? Choose 3\n\nA. ApexPages.addErrorMessage()\nB. A custom exception\nC. .addError()\nD. Database.handleException()\nE. A try/catch construct","definition":"B. A custom exception\nC. .addError()\nE. A try/catch construct","rank":173},{"id":"6826181701","term":"A developer creates an APEX class that includes a private methods\nWhat can a developer do to ensure that the private methods can be accessed by the test class?\n\nA. Add the TestVisible attribute to the Apex class.\nB. Add the SeeAllData attribute to the test method.\nC. Add the SeeAllData attribute to the test class.\nD. Add the TestVisible attribute to the Apex methods.","definition":"D. Add the TestVisible attribute to the Apex methods.","rank":88},{"id":"8090130944","term":"A developer creates an Apex class that includes private methods.\nWhat can the developer do to ensure that the private methods can be accessed by the test class?\nA. Add the TestVisible attribute to the Apex class.\nB. Add the SeeAllData attribute to the test methods. C. Add the SeeAllData attribute to the test class.\nD. Add the TestVisible attribute to the Apex methods","definition":"D. Add the TestVisible attribute to the Apex methods.","rank":87},{"id":"8109272861","term":"A developer creates an Apex class that includes private methods. What can the developer do to ensure that the private methods can be accessed by the test class?\n\nA. Add the @TestVisible attribute to the Apex class\nB. Add the SeeAllData attribute to the test class\nC. Add the SeeAllData atrribute to the test methods\nD. Add the @TestVisible attribute to the Apex methods","definition":"D. Add the @TestVisible attribute to the Apex methods","rank":48},{"id":"6824375357","term":"A developer creates an Apex helper class to handle complex trigger logic.\n\nHow can the helper class warn users when the trigger exceeds DML governor limits?\n\nA. By using ApexMessage.Message() to display an error message after the number of DML statements is exceeded.\nB. By using Messaging.SendEmail() to continue the transaction and send an alert to the user after the number of DML statements is exceeded.\nC. By using PageReference.setRedirect() to redirect the user to a custom Visualforce page before the number of DML statements is exceeded.\nD. By using Limits.getDMLRows() and then display an error message before the number of DML statements is exceeded.","definition":"D. By using Limits.getDMLRows() and then display an error message before the number of DML statements is exceeded.","rank":58},{"id":"8109786069","term":"A developer creates an Apex helper class to handle complex trigger logic. How can the helper class warn users when the trigger exceeds DML governor limits?\n\nA. By using PageReference.setRedirect() to redirect the uuser to a custom Visualforce page before the number of DML statements is exceeded.\nB. By using ApexMessage.Message() to display an error essage after the number of DML statements is exceeded.\nC. By using Limits.GetDMLRows() and the displaying an error message before the number of DML statements os exceeded.\nD. By using Messaging.SendEmail() to continue the transactions and send an alert to the user after the number of DML statemens is exceeded.","definition":"C. By using Limits.GetDMLRows() and the displaying an error message before the number of DML statements os exceeded.","rank":159},{"id":"6816931203","term":"A developer creates an Apex trigger using the Developer Console and now wants to debug code. How can the developer accomplish this in the Developer Console?\n\nA. Select the override Log Triggers checkbox for the trigger.\nB. Add the user name in the Log Inspector\nC. Open the progress tab in the Developer Console\nD. Open the Logs tab in the Developer Console","definition":"D. Open the Logs tab in the Developer Console","rank":18},{"id":"6816983308","term":"A developer creates a new Visualforce page and Apex extension, and writes test classes that exercise 95% coverage of the new Apex extension.\n\nChange set deployment to production fails with the test coverage warning: \"Average test coverage across all Apex classes and Triggers is 74%, at least 75% test coverage is required.\"\n\nWhat can the developer do to successfully deploy the new Visualforce page and the extension?\n\nA. Create test classes to exercise the Visualforce page markup.\nB. Select \"Disable Parallel Apex Testing\" to run all the tests.\nC. Add test methods to existing test classes from previous deployments.\nD. Select \"Fast Deployment\" to bypass running all the tests.","definition":"C. Add test methods to existing test classes from previous deployments.","rank":29},{"id":"8089736898","term":"A developer creates a new Visualforce page and Apex extension, and writes test classes that exercise 95% coverage of the new Apex extension.\nChange set deployment to production fails with the test coverage warning: \"Average test coverage across all Apex classes and triggers is 74%, at least 75% test coverage is required.\"\nWhat can the developer do to successfully deploy the new Visualforce page and extension?\nA. Create test classes to exercise the Visualforce page markup.\nB. Select \"Disable Parallel Apex Testing\" to run all the tests.\nC. Add test methods to existing test classes from previous deployments. \nD. Select \"Fast Deployment\u0027\u0027 to bypass running all the tests.","definition":"C. Add test methods to existing test classes from previous deployments.","rank":29},{"id":"8109415609","term":"A developer creates a new Visualforce page and Apex extension,and writes test classes that exercise 95% coverage of the new Apex extension. Change set deployment to production fails with the test coverage warning : *Average test coverage across all apex classes and triggers is 74% at least 75% test coverage is required. What can the developer do to successfully deploy the new Visualforce page and extension?\n\nA. Select Disable Parallel Apex testing to run all the test\nB. Select fast Deployment to bypass running all the tests.\nC. Create test classes to exercise the visualforce page markup\nD. Add test methods to existing test classes from previous deployments.","definition":"D. Add test methods to existing test classes from previous deployments.","rank":86},{"id":"6816797519","term":"A developer creates a Workflow Rule declaratively that updates a field on an Object. An Apex trigger exists for the object.\n\nWhat happens when a user updates a record?\n\nA. No changes are made to the data.\nB. Both Apex Trigger and Workflow Rule are fired only once.\nC. The workflow Rules is fired more than once.\nD. The Apex Trigger is fired more than once.","definition":"D. The Apex Trigger is fired more than once.","rank":9},{"id":"8089128679","term":"A developer creates a Workflow Rule declaratively that updates a field on an object. An Apex update trigger exists for that object.\nWhat happens when a user updates a record?\nA. No changes are made to the data.\nB. Both the Apex Trigger and Workflow Rule are fired only once. \nC. The Workflow Rule is fired more than once.\nD. The Apex Trigger is fired more than once.","definition":"D. The Apex Trigger is fired more than once.","rank":10},{"id":"8109492114","term":"A developer creates a Workflow Rule declaratively that updates a field on an object. An Apex update trigger exists for this object. What happens when a user updates the record?\n\nA. No changes are made to the data.\nB. The Workflow Rule is fired more than once.\nC. Both the Apex Trigger and Workflow Rule are fired only once.\nD. The Apex Trigger is fired more than once.","definition":"D. The Apex Trigger is fired more than once.","rank":109},{"id":"8109369823","term":"A developer executes following code in Console\n\nlist\u003cAccount\u003e flist \u003d new list\u003cAccount\u003e();\nfor(integer i\u003d1;i\u003c\u003d200 ;i++){\nflist.add(new Account(name\u003d\u0027Test Acc\u0027+i));\n}\ninsert flist;\n\nlist\u003cAccount\u003e Llist \u003d new list\u003cAccount\u003e();\nfor(integer i\u003d201;i\u003c\u003d20000 ;i++){\nLlist.add(new Account(name\u003d\u0027Test Acc\u0027+i));\n}\ninsert Llist ;\n\nWhat will be the output :\n\nA. Insert all records\nB. Error will occur\nC. Insert 200 only\nD. 0 records inserted","definition":"B. Error will occur","rank":71},{"id":"8090283948","term":"A developer executes following code in Console. What will happen? list\u003cAccount\u003e flist \u003d new list\u003cAccount\u003e();\nfor(integer i\u003d1;i\u003c\u003d200 ;i++){\nflist.add(new Account(name\u003d\u0027Test Acc\u0027+i));\n}\ninsert flist;\nlist\u003cAccount\u003e Llist \u003d new list\u003cAccount\u003e(); for(integer i\u003d201;i\u003c\u003d20000 ;i++){ Llist.add(new Account(name\u003d\u0027Test Acc\u0027+i)); }\ninsert Llist ;\nA. Error will occur \nB. Insert all records \nC. Insert 200 only \nD. Records inserted","definition":"A. Error will occur","rank":136},{"id":"6816923249","term":"A developer has a block of code that omits any statements that indicate whether the block should execute with or without sharing.\n\nWhat will automatically obey the organization-wide defaults and sharing settings for the user who executes the code in the Salesforce organization?\n\nA. Apex Trigger\nB. Http Callout\nC. Apex Controllers\nD. Anonymous Blocks","definition":"D. Anonymous Blocks","rank":17},{"id":"6826241580","term":"A developer has a block of code that omits any statements that indicate whether the code block should execute with or without sharing.\nWhat will automatically obey the organization-wide defaults and sharing settings for the user who executes the code in the salesforce organization?\n\nA. Anonymous block\nB. Apex controllers\nC. Http callouts\nD. Apex triggers","definition":"A. Anonymous block","rank":96},{"id":"8109198936","term":"A Developer has a block of code that omits any statements that indicate whether the code block should execute with sharing or without sharing. What will automatically obey the org wide default and sharing settings for the user who executes the code in salesforce organization?\n\nA. Apex Triggers\nB. HTTP Callouts\nC. Apex Controllers\nD. Anonymous Blocks","definition":"D. Anonymous Blocks","rank":41},{"id":"6824320104","term":"A developer has a following trigger that fires after insert and creates a child Case whenever a new Case is created.\n\nList\u003cCase\u003e childCases \u003d new List\u003cCase\u003e();\nfor(Case parent: Trigger.new ) {\nCase child \u003d new Case(ParentId \u003d parent.Id, Subject \u003d parent.Subject);\nchildCases.add(child);\n}\ninsert childCases;\n\nWhat happens after the code block executes?\n\nA. Multiple child cases are created for each parent case in Trigger.new\nB. A child case is created for each parent case in Trigger.new.\nC. The trigger enter an infinite loop and eventually fails.\nD. The trigger fails if the Subject field on the Parent is blank.","definition":"C. The trigger enter an infinite loop and eventually fails.","rank":50},{"id":"8089791872","term":"A developer has a single custom controller class that works with a Visualforce Wizard to support creating and editing multiple sObjects. The wizard accepts data from user inputs across multiple Visualforce pages and from a parameter on the initial URL\nWhich statement is unnecessary inside the unit test for the custom controller?\nA. public ExtendedController (ApexPages.StandardController cntrl) { }\nB. ApexPages.currentPage().getParameters().put(\u0027input\u0027, \u0027TestValue\u0027)\nC. Test.setCurrentPage(pageRef),\nD. String nextPage \u003d controller.save().getUrl();","definition":"D. String nextPage \u003d controller.save().getUrl();","rank":38},{"id":"6817338238","term":"A developer has a single custom controller class that works with a Visualforce Wizard to support creating and editing multiple sObjects. The wizard accepts data from user inputs across multiple Visualforce pages and from a parameter on the initial URL.\n\nWhich statement is unnecessary inside the unit test for the custom controller?\n\nA. public ExtendController(ApexPages.StandardController cntrl) {}\nB. ApexPages.currentPage().getParameters().put(\u0027input\u0027, \u0027TestValue\u0027);\nC. Test.setCurrentPage(pageref);\nD. String nextPage \u003d controller.save().getUrl();","definition":"D. String nextPage \u003d controller.save().getUrl();","rank":37},{"id":"8109432303","term":"A developer has a single custom controller class that works with a Visualforce Wizard to support creating and editing multiple sObjects. The wizard accepts data from user inputs across multiple Visualforce pages and from a parameter on the initial URL. Which statement is unnecessary inside the unit test for the custom controller?\n\nA. public ExtendedController(ApexPages.StandardController cntrl) { )\nB. ApexPages.currentPage().getParameters() put(input\u0027, \u0027TestValue).\nC. Test.setCurrentPage(pageRef).\nD. String nextPage \u003d controller.save().getUrl();","definition":"A. public ExtendedController(ApexPages.StandardController cntrl) { )","rank":90},{"id":"8090395576","term":"A developer has completed work in the sandbox and is ready to send it to a related org, what deployment tool should be used?\nA. Change Sets\nB. Force.com IDE\nC. Unmanaged Packages\nD. Force.com Migration Tool","definition":"A. Change Sets","rank":162},{"id":"8109782968","term":"A developer has following code.\n\ntry{\nList\u003cString\u003e nameList;\nAccount a;\nString s \u003d a.Name;\nnameList.add(s);\n}\ncatch(ListException le){\nSystem.debug(\u0027List Exception\u0027);\n}\ncatch(NullPointerException npe){\nSystem.debug(\u0027NullPointer Exception\u0027);\n}\ncatch(Exception e){\nSystem.debug(\u0027Generic Exception\u0027);an ap\n}\n\nWhat message would be logged?\n\nA. No message is logged\nB. Generic Exception\nC. List Exception\nD. NullPointer Exception","definition":"D. NullPointer Exception","rank":158},{"id":"8090139066","term":"A developer has following query\nContact c \u003d [SELECT Id, FirstName, LastName, Email FROM Contact WHERE LastName \u003d \u0027Smith\u0027];\nWhat does the query return if there is no Contact with the last name \"Smith\"?\nA. A Contact with empty values.\nB. A Contact initialized to null.\nC. An empty List of Contacts.\nD. An error that no rows are found.","definition":"D. An error that no rows are found.","rank":91},{"id":"6826150041","term":"A developer has the following code.\n\ntry {\nList\u003cString\u003e nameList;\nAccount a;\nString s \u003d a.Name;\nnameList.add(s);\n} Catch(ListException le) {\nSystem.debug(\u0027List Exception\u0027);\n} Catch(NullPointerException npe) {\nSystem.debug(\u0027NullPointer Exception\u0027);\n} Catch(Exception e) {\nSystem.debug(\u0027Generic Exception\u0027);\n}\n\nWhat message would be logged?\n\nA. No message is logged.\nB. Generic exception.\nC. List Exception.\nD. NullPointer Exception","definition":"D. NullPointer Exception","rank":82},{"id":"8090116153","term":"A developer has the following code.\ntry\n{\nList\u003cString\u003e nameList;\nAccount a;\nString s \u003d a.Name;\nnameList.add(s);\n}\ncatch (ListException le)\n{\nSystem.debug(\u0027List Exception\u0027);\n}\ncatch (NullPointerException npe)\n{\nSystem.debug(\u0027NullPointer Exception\u0027); }\ncatch (Exception e)\n{\nSystem.debug(\u0027Generic Exception\u0027);\n}\nWhat message would be logged? \nA. No message is logged\nB. Generic Exception\nC. List Exception\nD. NullPointer Exception","definition":"D. NullPointer Exception","rank":82},{"id":"8109808706","term":"A developer has the following code block:\n\nPublic class PaymentTax {\nPublic static decimal salesTax \u003d 0.0875;\n}\n\nTrigger OpportunityLineItemTrigger on OpportunityLineItem(before insert, before update)\n{\nPaymentTax PayTax \u003d new PaymentTax();\nDecimal ProductTax \u003d ProductCost \u003d XXXXXXXXXXXXX;\n}\nTo calculate the productTax wich code segment would adeveloper insert at the XXXXXXXX to make the value of the classvariable SalesTax accessible within the trigger?\n\nA. SalesTax.\nB. PayTax.SalesTax.\nC. PaymentTax.SalesTax.\nD. OpportunityLineItemTrigger.SalesTax.","definition":"C. PaymentTax.SalesTax.","rank":165},{"id":"6824360467","term":"A developer has the following code block:\n\npublic class PaymentTax {\npublic static decimal SalesTax \u003d 0.0875;\n}\ntrigger OpportunityLineItemTrigger on OpportunityLineItem (before insert, before update) {\nPaymentTax PayTax \u003d new PaymentTax();\ndecimal ProductTax \u003d ProductCost * XXXXXXXXXXXXX;\n....\n}\n\nTo calculate the ProductTax, which code segment would a developer insert at the XXXXXXXXXXXXX to make the value the class variable SalesTax accessible within the trigger?\nA. SalesTax\nB. PayTax. SalesTax\nC. PaymentTaxt. SalesTax\nD. OpportunityLineItemTrigger. SalesTax","definition":"C. PaymentTaxt. SalesTax","rank":56},{"id":"8090042904","term":"A developer has the following code block:\npublic class PaymentTax {\npublic static decimal SalesTax \u003d 0.0875; }\ntrigger OpportunityLineItemTrigger on OpportunityLineItem (before insert, before update) {\nPaymentTax PayTax \u003d new PaymentTax();\ndecimal ProductTax \u003d ProductCost * XXXXXXXXXXX;\n}\nTo calculate the productTax, which code segment would a developer insert at the XXXXXXXXXXX to make the value the class variable SalesTax accessible within the trigger?\nA. SalesTax\nB. PayTax.SalesTax\nC. PaymentTax.SalesTax\nD. OpportunityLineItemTngger.SalesTax","definition":"C. PaymentTax.SalesTax","rank":57},{"id":"6826205445","term":"A developer has the following query:\n\nContact c \u003d [ select id, email from Contact where lastname\u003d\u0027Smith\u0027 ];\n\nWhat does the query return if there is no Contact with the last name \"Smith\"?\n\nA. A contact with empty values\nB. A contact initialized to null.\nC. An empty list of contacts\nD. An error that no rows are found.","definition":"D. An error that no rows are found.","rank":92},{"id":"8137573160","term":"A developer has the following query: Contact c \u003d [SELECT id, firstname, lastname, email FROM Contact WHERE lastname \u003d \u0027Smith\u0027]; What does the query return if there is no Contact with the last name \u0027Smith\u0027?\nA.\n\nA. A contact initialized to null.\nB.\n\nB. An error that no rows are found.\nC.\n\nC. An empty List of Contacts.\nD.\n\nD. A Contact with empty values.","definition":"B. An error that no rows are found.","rank":14},{"id":"8109715096","term":"A developer has the following trigger that fires after insert and creates a child Case whenever a new Case is created.\nList\u003cCase\u003e childcases \u003d new List\u003cCase\u003e();\nFor (Case parent: Trigger.new) {\nCase child \u003d new Case(ParentId \u003d parent.Id, Subject \u003dparent.Subject);\nchildCases.add(child);\n}\ninsert childCases;\n\nWhat happens after the code block executes?\n\nA. The trigger enters an infinite loop and eventually fails\nB. A child case is created for each parent case in Trigger.new\nC. The trigger fails if the Subject field on the parent is blank\nD. Multiple child cases are created for each parent case in Trigger.new","definition":"A. The trigger enters an infinite loop and eventually fails","rank":142},{"id":"8090024724","term":"A developer has the following trigger that fires after insert and creates a child Case whenever a new Case is created.\nList\u003cCase\u003e childCases \u003d new List\u003cCase\u003e();\nfor (Case parent : Trigger.new){\nCase child \u003d new Case(ParentId \u003d parent.Id, Subject \u003d parent.Subject);\nchildCases.add(child);\n}\ninsert childCases;\nWhat happens after the code block executes?\nA. Multiple child cases are created for each parent case in Trigger.new.\nB. child case is created for each parent case in Trigger.new. C. The trigger enters an infinite loop and eventually fails.\nD. The trigger fails if the Subject field on the parent is blank","definition":"C. The trigger enters an infinite loop and eventually fails.","rank":51},{"id":"8109419392","term":"A developer in a Salesforce org with 100 Accounts executes the following code using the Developer console:\n\nAccount a \u003d new Account(Name\u003d\u0027New Account\u0027);\ninsert a;\n\nfor(Integer i\u003d0; i\u003c 150; i++) {\nAccount a \u003d new Account(Name\u003d\u0027New Account\u0027 + i);\n\ntry {\ninsert a; \n} catch(DmlException e) {\nSystem.debug(\u0027An unexpected error has occurred: \u0027 + \ne.getMessage());\n}\n}\n\nAccount a \u003d new Account(Name\u003d\u0027New Account\u0027);\ninsert a;\n\nHow many accounts are in the org after this code is run?\n\nA. 101\nB. 100\nC. 102\nD. 252","definition":"B. 100","rank":87},{"id":"8089828078","term":"A developer in a Salesforce org with 100 Accounts executes the following code using the Developer console:\nAccount myAccount \u003d new Account(Name \u003d \u0027MyAccount\u0027); Insert myAccount;\nFor (Integer x \u003d 0; x \u003c 250; x++)\nAccount newAccount \u003d new Account (Name\u003d\u0027MyAccount\u0027 + x); try {\nInsert newAccount;\n}\ncatch (Exception ex) { System.debug (ex) ;\n}\ninsert new Account (Name\u003d\u0027myAccount\u0027);\nHow many accounts are in the org after this code is run? \nA. 101\nB. 100\nC. 102\nD. 252","definition":"B. 100","rank":45},{"id":"8138055659","term":"A developer in a Salesforce org with 100 Accounts executes the following code using the Developer console:Account myAccount \u003d new Account(Name \u003d \u0027MyAccount\u0027);Insert myAccount;For (Integer x \u003d 0; x \u003c 150; x++) {Account newAccount \u003d new Account (Name\u003d\u0027MyAccount\u0027 + x);try {Insert newAccount;} catch (Exception ex) {System.debug (ex) ;}}insert new Account (Name\u003d\u0027myAccount\u0027);How many accounts are in the org after this code is run?\nA.\n\n101\nB.\n\n100\nC.\n\n102\nD.\n\n252","definition":"100","rank":32},{"id":"6824288190","term":"A developer in a Salesforce org with 100 executes the following code using the Developer Console:\n\nAccount myAccount \u003d new Account(Name\u003d\u0027MyAccount\u0027);\ninsert myAccount;\nfor(Integer x \u003d 0; x \u003c 150; x++) {\nAccount newAccount \u003d new Account(Name\u003d\u0027MyAccount\u0027 + x);\ntry {\ninsert newAccount;\n} catch(Exception ex) {\nSystem.debug(ex);\n}\n}\ninsert new Account(Name\u003d\u0027MyAccount\u0027);\n\nHow many accounts are in the org after this code is run?\n\nA. 101\nB. 100\nC. 102\nD. 252","definition":"B. 100","rank":44},{"id":"6816998019","term":"A developer is creating an application to track engine and their parts. An individual part can be used in different types of engines.\n\nWhat data model should be used to track the data to prevent orphan records?\n\nA. Create a junction object to relate many engine to many parts through a master-detail relationship\nB. Create a master-detail relationship to represent the one-to-many model of engine parts.\nC. Create a lookup relationship to represent how each part relates to the parent engine object.\nD. Create a junction object to relate many engines to many parts through a lookup relationship","definition":"A. Create a junction object to relate many engine to many parts through a master-detail relationship","rank":31},{"id":"8109557122","term":"A developer is creating an application to track engines and their components. An individual component can be used in different types of engines. What data model should be used to track the data and to prevent orphan records?\n\nA. Create a junction object to relate many engines to many parts through a master-detail relationship\nB. Create a lookup relationship to represent how each part relates to the parent engine object\nC. Create a master-detail relationship to represent the one-to-many model of engines to parts\nD. Create a junction object to relate many engines to many parts through a lookup relationship","definition":"A. Create a junction object to relate many engines to many parts through a master-detail relationship","rank":131},{"id":"8089719473","term":"A developer is creating an application to track engines and their parts. An individual part can be used in different types of engines.\nWhat data model should be used to track the data and to prevent orphan records.\nA. Create a junction object to relate many engines to many parts though a master - detail relationship.\nB. Create a master -detail relationship to represent the one -to -many model of engines to parts\nC. Create a lookup relationship to represent how each part relates to the parent engine object.\nD. Create a junction object to relate many engines to many parts through a lookup relationship.","definition":"A. Create a junction object to relate many engines to many parts though a master -detail relationship.","rank":25},{"id":"8109495997","term":"A developer needs to automatically populate the ReportsTo field in a Contact record based on the values of the related Account and Department fields in the record. Which type of Trigger would the developer create? Select all that apply.\n\nA. Before insert\nB. After update\nC. After insert\nD. Before update","definition":"A. Before insert\nD. Before update","rank":110},{"id":"6816993295","term":"A developer needs to automatically populate the Reports To field in a Contact record on the values of the related Account and Department fields in the Contact record.\n\nWhich type of trigger would the developer create? Choose 2 answers\n\nA. before update\nB. after insert\nC. before insert\nD. after update","definition":"A. before update\nC. before insert","rank":30},{"id":"8090108059","term":"A developer needs to create a Visualforce page that will override standard Account edit button. The page will be used to validate the account\u0027s address using a SOQL query. The page will also allow the user to make edits to the address.\nWhere would the developer write the Account address verification logic?\nA. In a Controller Extension. B. In a Custom Controller. \nC. In a Standard Controller. D. In a Standard Extension.","definition":"A. In a Controller Extension","rank":79},{"id":"6826134286","term":"A developer needs to create a Visualforce page that will override the standard Account edit button. The page will be used to validate the account\u0027s address using a SOQL query. The page will also allow the user to make edits to the address.\n\nWhere would the developer write the Account address verification logic?\n\nA. In a Controller Extension\nB. In a custom controller\nC. In a standard controller\nD. In a standard extension","definition":"A. In a Controller Extension","rank":79},{"id":"8137952114","term":"A developer needs to create a Visualforce page that will override the standard Account edit button. The page will be used to validate the account\u0027s address using a SOQL query. The page will also allow the user to make edits to the address. Where would the developer write the Account address verification logic?\nA.\n\nIn a Standard Extension.\nB.\n\nIn a Standard Controller.\nC.\n\nIn a Custom Controller.\nD.\n\nIn a Controller Extension.","definition":"In a Controller Extension.","rank":20},{"id":"8109307670","term":"A developer needs to create a visualforce page that will override the standard Account edit button. The page will be used to validate the accounts address using SOQL query. The page will also allow the user to make the edits to the address. Where would the developer write the Account address verification logic?\n\nA. In a Controller Extension\nB. In a Standard Extension\nC. In a Custom Controller\nD. In a Standard Controller","definition":"A. In a Controller Extension","rank":55},{"id":"8109451710","term":"A developer needs to create records for the object Property__c. The developer creates the following code block:\n\nList\u003cProperty__c\u003e propertiesToCreate \u003dhelperClass.CreateProperties();\n\nTry{\n03\n} Catch (Exception exp){ }\n\nWhich line of code would the developer insert at line 03 to ensure that at least some records are created, even if a few records have errors and fail to be created?\n\nA. Insert propertiesToCreate;\nB. Database.insert(propertiesToCreate,false);\nC. Databas.insert(propertiesToCreate);\nD. Datebase.insert(propertiesToCreate,System.ALLOW_PARTIAL);","definition":"B. Database.insert(propertiesToCreate,false);","rank":96},{"id":"6824341116","term":"A developer needs to create records for the object Property__c. The developer creates the following code block:\n\nList\u003c Property__c\u003e propertiesToCreate \u003d helperClass.createProperties();\ntry {\n// line 03\n} catch (Exception exp) {\n// Exception handling\n}\n\nWhich line of code would the developer insert at line 03 to ensure that at least some records are created, even if a few records have errors and fail to be created?\n\nA. Database.insert(propertiesToCreate, System.ALLOW_PARTIAL);\nB. insert propertiesToCreate;\nC. Database.insert(propertiesToCreate, false);\nD. Database.insert(propertiesToCreate);","definition":"C. Database.insert(propertiesToCreate, false);","rank":53},{"id":"8090033848","term":"A developer needs to create records for the object Property__c .The developer creates the following code block:\n01 List\u003cProperty__c\u003e propertiesToCreate \u003dhelperClass.CreateProperties();\n02 try {\n03\n04 } catch (Exception exp) {\n05 //Exception handling\n06 }\nWhich line of code would the developer insert at line 03 to ensure that at least some records are created, even if a record have errors and fails to be created?\nA. Database.insert(propertiesToCreate, System.ALLOW_PARTIAL);\nB. insert propertiesToCreate,\nC. Database.insert(propertiesToCreate, false); D. Database.insert(propertiesToCreate)","definition":"C. Database.insert(propertiesToCreate, false);","rank":54},{"id":"8090196668","term":"A developer needs to ensure there is sufficient test coverage for an Apex Method that interacts with Accounts. The developer needs to create test data.\nWhat is the preferred way to load this test data into Salesforce?\nA. By using Documents.\nB. By using HttpCalloutMocks. \nC. By using WebServiceTests. \nD. By using Static Resources.","definition":"D. By using Static Resources","rank":111},{"id":"8109442506","term":"A developer needs to ensure there is sufficient test coverage for an Apex method that interacts with Accounts. The developer needs to create test data. What is the preferred way to load this test data into Salesforce?\n\nA. By using HttpCalloutMocks\nB. By using Documents\nC. By using WebServiceTests\nD. By using Static Resources","definition":"D. By using Static Resources","rank":93},{"id":"8109138475","term":"A developer needs to know if all tests currently pass in a Salesforce environment. Which feature can the developer use? Choose 2 answers.\n\nA. Salesforce UI Apex Test Execution\nB. Workbench Metadata Retrieval\nC. Developer Console\nD. ANT Migration Tool","definition":"A. Salesforce UI Apex Test Execution\nC. Developer Console","rank":37},{"id":"8090164361","term":"A developer needs to know if all tests currently pass in salesforce environment\nWhich feature can the developer use?\nChoose 2 answers\nA. Developer Console.\nB. ANT Migration Tool\nC. Salesforce UI Apex Test Execution \nD. Workbench Metadata Retrieval","definition":"A. Developer Console.\nC. Salesforce UI Apex Test Execution","rank":99},{"id":"6824275776","term":"A developer needs to provide a Visualforce page that lets users enter Product-specific details during a Sales cycle.\n\nHow can this be accomplishes? Choose 2 answers\n\nA. Download a Managed Package from the AppExchange that provides a custom Visualforce page to modify.\nB. Create a new Visualforce page and an Apex controller to provide Product data entry\nC. Copy the standard page and then make a new Visualforce page for Product data entry.\nD. Download an Unmanaged package from the AppExchange that provides custom Visualforce page to modify.","definition":"B. Create a new Visualforce page and an Apex controller to provide Product data entry\nD. Download an Unmanaged package from the AppExchange that provides custom Visualforce page to modify.","rank":42},{"id":"8109478631","term":"A developer needs to provide a Visualforce page that lets users enter product-specific details during a sales cycle. How can this be accomplished? Select all that apply.\n\nA. Download a Managed Package from the AppExchange that provides a custom Visualforce page to modify\nB. Copy the standard page and then make a new Visualforce page for Product data entry\nC. Download an Unmanaged Package from the AppExchange that provides a custom Visualforce page to modify\nD. Create a new Visufalforce page and an Apex controller to provide Product data entry","definition":"C. Download an Unmanaged Package from the AppExchange that provides a custom Visualforce page to modify\nD. Create a new Visufalforce page and an Apex controller to provide Product data entry","rank":105},{"id":"8089819793","term":"A developer needs to provide a Visualforce page that lets users enter Product specific details during a Sales cycle.\nHow can this be accomplished?\nChoose 2 answers\nprovide Product data entry.\nA. Download a Managed Package from the AppExchange that provides a custom Visualforce page to modify.\nB. Create a new Visualforce page and an Apex controller to provide Product data entry.\nC. Copy the standard page and then make a Visualforce page for product data entry.\nD. Download an Unmanaged Package from the AppExchange that provides a custom Visualforce page to modify.","definition":"B. Create a new Visualforce page and an Apex controller to provide Product data entry.\nD. Download an Unmanaged Package from the AppExchange that provides a custom Visualforce page to modify.","rank":43},{"id":"8109519960","term":"A developer runs the following anonymous code block: \n\nList\u003cAccount\u003e acc \u003d [SELECT Id FROM Account LIMIT 10;]; \nDelete acc; \nDatabase.emptyRecycleBin(acc); \nsystem.debug(Limits.getDMLStatements() + \u0027, \u0027+Limits.getLimitsDMLStatements()); \n\nWhat is the result?\n\nA. 2, 150\nB. 150, 2\nC. 11, 150\nD. 150, 11","definition":"A. 2, 150","rank":118},{"id":"6826192849","term":"A developer runs the following anonymous code block:\n\nList\u003cAccount\u003e acc \u003d [select id from Account limit 10];\nDelete acc;\nDatabase.emptyRecycleBin(acc);\nSystem.debug(Limits.getDMLStatements() + \u0027, \u0027 + Limits.getLimitDMLStatements());\n\nWhat is the result?\n\nA. 11, 150\nB. 150, 2\nC. 150, 11\nD. 2, 150","definition":"D. 2, 150","rank":90},{"id":"8090135209","term":"A developer runs the following anonymous code block:\nList\u003cAccount\u003e acc \u003d [SELECT Id FROM Account LIMIT 10];\nDelete acc;\nDatabase.emptyRecycleBin(acc);\nsystem.debug(Limits.getDMLStatements()+ 1, 1 +Limits.getLimitDMLStatements()); What is the result?\nA. 11, 150 \nB. 150, 2 \nC. 150, 11 \nD. 2, 150","definition":"D. 2, 150","rank":89},{"id":"8109505915","term":"A developer uses a before insert trigger on the Lead object to fetch Territoy__c object, where the Territory__c. PostalCode__c matches the Lead.PostalCode. The code fails when the developer uses the Apex Data Loader to insert 10000 Lead records\u003e The developer has the following code block:\n\nfor(Lead l : Trigger.new){ \nif(l.PostalCode !\u003d null){ \nList\u003cTerritory__C\u003e terrList \u003d [SELECT Id FROM Territory__c WHERE PostalCode__c \u003d:l.PostalCode;] \nif(terrList.size() \u003e 0){ \nl.Territory__c \u003d terrList[0].Id; \n} \n} \n} \n\nWhich line of code is causing the code block to fail?\n\nA. 05: The Lead in a \"before insert\" trigger cannot be updated.\nB. 02: A NullPointer exception is thrown if PostalCode is null.\nC. 01: Trigger.new is not valid in a \"before insert\" Trigger.\nD. 03: A SOQL query is located inside the \"for\" loop code.","definition":"D. 03: A SOQL query is located inside the \"for\" loop code.","rank":113},{"id":"8089104431","term":"A developer uses a before insert trigger on the Lead object to fetch the Territory__c object, where the Territory__c.PostalCode__c matches the Lead.PostalCode. The code fails when the developer uses the Apex Data Loader to insert 10,000 Lead records. The developer has the following code block:\n\nLine-01: for (Lead l : Trigger.new){\nLine-02: if (l.PostalCode !\u003d null) {\nLine-03: List\u003cTerritory__c\u003e terrList \u003d [SELECT Id FROM Territory__c WHERE PostalCode__c \u003d :l.PostalCode];\nLine-04: if(terrList.size() \u003e 0)\nLine-05: l.Territory__c \u003d terrList[0].Id;\nLine-06: }\nLine-07: }\n\nWhich line of code is causing the code block to fail?\n\nA. Line-03: A SOQL query is located inside of the for loop code. B. Line-01: Trigger:new is not valid in a before insert Trigger.\nC. Line-02: A NullPointer exception is thrown if PostalCode is null. D. Line-05: The Lead in a before insert trigger cannot be updated","definition":"A","rank":2},{"id":"8090026602","term":"A Developer wants to create a custom object to track Customer Invoices.\nHow should Invoices and Accounts be related to ensure that all Invoices are visible to everyone with access to Account?\nA. The Account should have a Lookup relationship to the Invoice.\nB. The Invoice should have a Master -Detail relationship to the Account.\nC. The Account should have a Master -Detail relationship to the Invoice.\nD. The Invoice should have a Lookup relationship to the Account.","definition":"B. The Invoice should have a Master -Detail relationship to the Account.\nReasons:\nIt has to be master detail relationship to ensure that all child records are visible to everyone with access to Master(Account)\nThe Invoice should have a Master -Detail relationship to the Account ie. Account has to be master NOT the invoice","rank":52},{"id":"6824330433","term":"A developer wants to create a custom object to track Customer Invoices.\nHow should Invoices and Accounts be related to ensure that all Invoices are visible to everyone with access to an Account?\n\nA. The Account should have a Lookup relationships to the Invoice.\nB. The Invoice should have a Master-Detail relationship to the Account\nC. The Account should have a Master-Detail relationship to the Invoice.\nD. The Invoice should have a Lookup relationship to the Account","definition":"B. The Invoice should have a Master-Detail relationship to the Account","rank":51},{"id":"8109548886","term":"A Developer wants to create a custom object to track Customer Invoices. How should Invoices and Accounts be related to ensure that all Invoices are visible to everyone with access to an Account?\n\nA. The Account should have a Lookup relationship to the Invoice.\nB. The Account should have a Master-Detail relationship to the Invoice.\nC. The Invoice should have a Master-Detail relationship to the Account.\nD. The Invoice should have a Lookup relationship to the Account.","definition":"C. The Invoice should have a Master-Detail relationship to the Account.","rank":128},{"id":"6817340494","term":"A developer wants to display all of the available record types for a Case object. The developer also wants to display the picklist values for the Case.Status field. The Case object and the Case.Status field are on a custom Visualforce page.\n\nWhich action can the developer perform to get the record types and picklist values in the controller? Choose 2 answers.\n\nA. Use Schema.PicklistEntry returned by Case.Status.getDescribe().getPicklistValues();\nB. Use Schema.RecordTypeInfo retunred by Case.SObjectType.getDescribe().getRecordTypeInfos();\nC. Use SOQL to query records in the org to get all the RecordType values available for Case.\nD. Use SOSL to query Case records in the org to get all values for the Status picklist field.","definition":"A. Use Schema.PicklistEntry returned by Case.Status.getDescribe().getPicklistValues();\nB. Use Schema.RecordTypeInfo retunred by Case.SObjectType.getDescribe().getRecordTypeInfos();","rank":38},{"id":"8109473014","term":"A developer wants to display all of the available record types for a Case object. The developer also wants to display the picklist values for the Case.Status field. The Case object and the Case.Status field are on a custom Visualforce page. What action can the developer perform to get the record types and picklist values in the controller? Select all that apply.\n\nA. Use Schema.PickListEntry returned by Case.Status.getDescribe().getPicklistValues()\nB. Use Schema.RecordTypeInfo returned by Case.SObjectType.GetDescribe().getRecordTypeInfos()\nC. Use SOQL to query Case records in the org to get all the RecordType values available for Case\nD. Use SOQL to query case records in the org to get all values for the Status picklist field","definition":"A. Use Schema.PickListEntry returned by Case.Status.getDescribe().getPicklistValues()\nB. Use Schema.RecordTypeInfo returned by Case.SObjectType.GetDescribe().getRecordTypeInfos()","rank":103},{"id":"6924756666","term":"A developer wants to display all of the available record types for a Case object. The developer also wants to display the picklist values for the Case.Status field. The Case object and the Case Status field are on a custom visualforce page. Which action can the developer perform to get the record types and picklist values in the controller? Choose 2 answers\n\nA. Use Schema.PIcklistEntry returned by Case Status getDescribe().getPicklistValues().\nB. Use Schema.RecordTypelnfo returned by Case.SObjectType getDescribe().getRecordTypelnfos()\nC. Use SOQL to query Case records in the org to get all the RecordType values available for Case. \nD. Use SOQL to query Case records In the org to get all value for the Status pickiest field.","definition":"A, B : Use schema method to fetch such datas","rank":115},{"id":"6826261264","term":"A developer wants to know if all tests currently pass in a Salesforce environment. Which feature can the developer use? Choose 2 answers.\n\nA. Developer console\nB. ANT migration tool\nC. Salesforce UI Apex Test Execution\nD. Workbench Metadata Retrieval","definition":"A. Developer console\nC. Salesforce UI Apex Test Execution","rank":100},{"id":"6826141868","term":"A developer wants to list all of the Tasks for each Account on the Account detail page.\nWhen a Task is created for a Contact, what does the developer need to do to display the Task on the related Account record?\n\nA. Create an Account formula field that displays the Task information\nB. Nothing. The Task is automatically displayed on the Account page.\nC. Create a Workflow Rule to relate the Task to the Contact\u0027s Account.\nD. Nothing. The Task cannot be related to an Account and a Contact.","definition":"B. Nothing. The Task is automatically displayed on the Account page.","rank":80},{"id":"8109304351","term":"A developer wants to list all of the Tasks for each Account on the Account detail page. When a Task is created for a contact, what does the developer need to do to display the Task on?\n\nA. Create a Workflow Rule to relate the Task to the Contact\u0027s Account\nB. Nothing. The Task cannot be related to an Account and a Contact\nC. Create an Account formula field that displays the Task information\nD. Nothing. The Task is automatically displayed on the Account Page.","definition":"D. Nothing. The Task is automatically displayed on the Account Page.","rank":54},{"id":"8090110502","term":"A developer wants to list all of the Tasks for each Account on the Account detail page. When a Task is created for a Contact what does the developer need to do to display the Task on the related Account record?\nA. Create an Account formula field that displays the Task information. \nB. Nothing. The Task is automatically displayed on the Account page. \nC. Create a Workflow Rule to relate the Task to the Contact\u0027s Account. \nD. Nothing. The Task cannot be related to an Account and a Contact.","definition":"B. Nothing. The Task is automatically displayed on the Account page.","rank":80},{"id":"6824284733","term":"A developer writes a before insert trigger.\n\nHow can the developer access the incoming records in the trigger body?\n\nA. By accessing the Trigger.new context variable.\nB. By accessing the Trigger.newRecords context variable.\nC. By accessing the Trigger.newMap context variable.\nD. By accessing the Trigger.newList context variable.","definition":"A. By accessing the Trigger.new context variable.","rank":43},{"id":"8089823988","term":"A developer writes a before insert trigger.\nHow can the developer access the incoming records in the trigger body ?\nA. By accessing the Trigger.new context variable.\nB. By accessing the Trigger.newRecords context variable. C. By accessing the Trigger.newMap context variable.\nD. By accessing the Tripper.newList context variable.","definition":"A. By accessing the Trigger.new context variable.","rank":44},{"id":"8109804477","term":"A developer writes a before insert trigger. How can the developer access the incoming records in the trigger body?\n\nA. By accessing the Trigger.new context variable.\nB. By accessing the Trigger.newRecords context Variable.\nC. By accessing the Trigger.newMap context variable.\nD. By accessing the Trigger.newList context variable.","definition":"A. By accessing the Trigger.new context variable.","rank":164},{"id":"8090161214","term":"A developer writes a SOQL query to find child records for a specific parent\nHow many specific levels can be returned in a single query ?\nA.3 \nB.5 \nC.1 \nD.7","definition":"C. 1","rank":98},{"id":"8109695465","term":"A developer writes a SOQL query to find child records for a specific parent. How many levels can be returned in a single query?\n\nA. 3\nB. 5\nC. 1\nD. 7","definition":"C. 1","rank":139},{"id":"8109791570","term":"A developer wrote a workflow email alert on case creation so that an email is sent to the case owner manager when a case is created.\n\nA. Before Committing to database\nB. After Commiting to database\nC. After Trigger execution\nD. Before Trigger execution","definition":"B. After Commiting to database","rank":161},{"id":"8089807200","term":"A developer wrote a workflow email alert on case creation so that an email is sent to the case owner manager when a case is created?\nWhen will the email be sent?\nA. Before Trigger execution\nB. After Committing to database. C. Before Committing to database \nD. After Trigger execution.","definition":"B. After Committing to database.","rank":41},{"id":"6824262750","term":"A developer wrote a workflow email alert on case creation so that an email is sent to the case owner manager when a case is created.\n\nWhen will the email be sent?\n\nA. Before Trigger execution\nB. After committing to database.\nC. Before committing to database.\nD. After Trigger Execution","definition":"B. After committing to database.","rank":40},{"id":"8090044511","term":"A developer wrote a workflow email alert on case creation so that an email is sent to the case owner manager when a case is created.\nWhen will the email be sent?\nA. After Committing to database.\nB. Before Committing to database. Calculator \nC. Before Trigger execution.\nD. After Trigger execution.","definition":"A. After Committing to database.","rank":59},{"id":"8137253336","term":"A developer wrote a workflow email alert on case creation so that an email is sent to the case owner manager when a case is created. When will the email be sent?\nA.\n\nA. After Committing to database.\nB.\n\nB. Before Trigger execution.\nC.\n\nC. After Trigger execution.\nD.\n\nD. Before Committing to database.","definition":"A. After Committing to database.","rank":5},{"id":"4714616792","term":"A field designated as required, is only required when it is added to a user\u0027s page layout.\n\nA. False\nB. True","definition":"A","rank":17},{"id":"4714593357","term":"A field flagged as an External ID is not required to be unique.\n\nA. True\nB. False","definition":"A","rank":5},{"id":"4714632996","term":"A field hidden by field level security is still visible through the API.\n\nA. False\nB. True","definition":"A","rank":32},{"id":"8090158833","term":"A Hierarchy Custom Setting stores a specific URL for each profile in Salesforce.\nWhich statement can a developer use to retrieve the correct URL for the current user\u0027s profile and display this Visualforce Page?\nA. {$Setup.Url_Settings_c.Instance[Profile.Id].URL__c} \nB. {!$Setup.Url_Settings_c.URL__c}\nC. {!$Setup.Url_Settings_c[Profile.Id,URL__c}\nD. {!$Setup.Url_Settings_c[$Profile.Id,URL__c}","definition":"B. {$Setup.Url_Settings_c.URL__c}","rank":97},{"id":"8109142620","term":"A hierarchy custom setting stores specific URL for each profile in sf. Which statement can a developer use to retrieve the correct URL for the current URl for the current user\u0027s profile and display this on a vf page?\n\nA. {!$Setup.Url_Settings__c.URL__c}\nB. {!$Setup.Url_Settings__c[$Profile.Id].URL__c}\nC. {!$Setup.Url_Settings_c.Instance[Profile.Id].URL__c}\nD. {!$Setup.Url_Settings__c[Profile.Id].URL__c}","definition":"A. {!$Setup.Url_Settings__c.URL__c}","rank":38},{"id":"4714594129","term":"A lookup relationship between two objects is loosely coupled.\n\nA. True\nB. False","definition":"A","rank":6},{"id":"8089114352","term":"An org has different Apex Classes that provide Account -related functionality.\nAfter a new validation rule is added to the object, many of the test methods fail.\nWhat can be done to resolve the failures and reduce the number of code changes needed for future validation rules?\nChoose 2 answers:\n\nA. Create a method that creates valid Account records, and call this method from within test methods.\nB. Create a method that loads valid Account records from a Static Resource, and call this method within test methods.\nC. Create a method that performs a callout for a valid Account record, and call this method from within test methods.\nD Create a method that queries for valid Account records, and call this method from within test methods.","definition":"A\nB","rank":5},{"id":"6816773411","term":"An org has different Apex classes that provide Account-related functionality. After a new validation rule is added to the Account object, many of the test methods fail.\n\nWhat can be done to resolve failures and reduce the number of code changes needed in future validation rules? Choose 2 answers.\n\nA. Create a method that creates valid Account records, and call this method from within test methods.\nB. Create a method that loads valid Account records from static resource, and call this method within test methods.\nC. Create a method that performs a callout for a valid Account record, and call this method within test methods.\nD. Create a method that queries for valid Account records, and call this method within test methods.","definition":"A. Create a method that creates valid Account records, and call this method from within test methods.\nB. Create a method that loads valid Account records from static resource, and call this method within test methods.","rank":4},{"id":"8109553759","term":"An org has different Apex Classes that provide Account related functionality. After a new validation rule is added to the Account object, many of the test methods fail. What can be done to resolve the failures and reduce the number of code changes needed for future validation rules? Select all that apply.\n\nA. Create a method that performs a callout for a valid Account record, and call this method from within test methods.\nB. Create a method that creates valid Account records, and call this method from within test methods.\nC. Create a method that queries for valid Account records, and call this method from within test methods.\nD. Create a method that loads valid Account records from a Static Resource, and call this method within test methods.","definition":"B. Create a method that creates valid Account records, and call this method from within test methods.\nD. Create a method that loads valid Account records from a Static Resource, and call this method within test methods.","rank":130},{"id":"6924767469","term":"An sObject named Application _c has a lookup relationship to another sObject named Position_c. Both Application _c and Position c have a picklist field named Status_c. When the Status c field on Position __c is updated, the Status_c field on Application _c needs to be populated automatically with the same value, and execute a workflow rule on Application c. Flow can a developer accomplish this?\n\nA. By changing Application c.Status_c into a roll-up summary field.\nB. By changing Application c.Status_c into a formula field. \nC. By using an Apex trigger with a DML operation.\nD. By configuring a cross-object field update with a workflow.","definition":"B","rank":116},{"id":"8089802338","term":"An sObject named Application_c has a lookup relationship to another sObject named Position_c. Both Application _c and Position_c have a picklist field named Status_c.\nWhen the Status_c field on Position_c is updated, the Status_c field on Application_c needs to be populated automatically with the same value, and execute a workflow rule on Application_c.\nHow can a developer accomplish this?\nA. By changing Application_c.Status_c into a roll -up summary field.\nB. By changing Application_c.Status_c into a formula field.\nC. By using an Apex trigger with a DML operation. \nD. By configuring a cross-object field update with a workflow.","definition":"B. By changing Application_c.Status_c into a formula field.","rank":40},{"id":"6817351208","term":"An sObject named Application__c has a lookup relationship to another sObject named Position__c.\nBoth Application__c and Position__c have a picklist field named Status__c.\nWhen the Status__c field on Position__c is updated, the Status__c fields on Application__c needs to be populated automatically with the same value, and execute a workflow rule on Application__c.\n\nHow can a developer accomplish this?\n\nA. By changing the Application__c.Status__c into a roll-up summary field.\nB. By changing the Application__c.Status__c into a formula field.\nC. By using an Apex trigger with a DML operation\nD. By configuring a cross-object field update with a workflow.","definition":"B. By changing the Application__c.Status__c into a formula field.","rank":39},{"id":"8109738335","term":"An sObject named Application__c has a lookup relationship to another sObject named Position__c Both Application__c and Position__c have a picklist field named Status__c. When the Status__c field on Position__c is updated, the Status__c field on Application__c needs automatically with the same value, and execute a workflow rule on Application__c. How can a developer accomplish this?\n\nA. By using an Apex trigger with a DML operation\nB. By Configuring a cross-object field update with a workflow\nC. By changing Application__c.Status__c into a formula field\nD. By changing Application__c.Status__c into a roll-up summary field","definition":"A. By using an Apex trigger with a DML operation","rank":147},{"id":"8109531545","term":"A person who does not have \"View Encrypted Data\" permission will see the field with masked characters. Assuming the field is in the page layout, what happens if he tries to edit the value by clicking on the Edit button?\n\nA. The field will not appear in the edit layout.\nB. The user will see only masked characters, but can enter a new value and save it.\nC. It will throw an error on changing that field and saving it.\nD. He can see the original value and he can save the record.","definition":"B. The user will see only masked characters, but can enter a new value and save it.","rank":122},{"id":"8108982253","term":"A platform developer wants to reference an image included in the sales force lightning design system from visual force page. Which two references should be included in the page markup?\n\nA. $Asset\nB. \u003c apex:slds \u003e\nC. $SLDS\nD. \u003c force:slds \u003e","definition":"A. $Asset\nB. \u003c apex:slds \u003e","rank":5},{"id":"8109535595","term":"A Position is a custom object containing details of each position. A Candidate contains the details of each candidate such as skills. When users view the Position records, they should also be able to see all those candidates who match the skills required for the post. A position record need not have details of candidates and a candidate record can also be kept blank. A position can be applied by multiple candidates, while a candidate can also apply for multiple positions. What can be done to achieve this?\n\nA. Create a master-child relationship between them\nB. Create a junction object to store both the values\nC. Create a lookup relationship of candidate on position\nD. Create a Visualforce page","definition":"B. Create a junction object to store both the values","rank":123},{"id":"6826087048","term":"A reviewer is required to enter a reason in the comments field only when a candidate is recommended to be hired.\n\nWhich action can a developer take to enforce this requirement?\n\nA. Create a required comment field\nB. Create a formula field\nC. Create a validation rule.\nD. Create a required Visulforce component.","definition":"C. Create a validation rule.","rank":74},{"id":"8090094609","term":"A reviewer is required to enter a reason in the comments field only when a candidate is recommended to be hired.\nWhich action can a developer take to enforce this requirement?\nA. Create a required comments field.\nB. Create a formula field.\nC. Create a validation rule.\nD. Create a required Visualforce component.","definition":"C. Create a validation rule.","rank":75},{"id":"8109322971","term":"A reviewer is required to enter a reason in the comments field only when a candidate is recommended to be hired. Which action can a developer take to enforce this requirement?\n\nA. Create a required Visualforce component\nB. Create a required comments field\nC. Create a formula field\nD. Create a validation rule","definition":"D. Create a validation rule","rank":59},{"id":"8090393612","term":"A salesperson at AW Computing only see\u0027s the Social Contact\u0027s link for Twitter and not Facebook on his records. Why would this be happening?\nA. Facebook is no longer supported by Social Contacts\nB. The administrator hasn\u0027t enabled Social Contacts for Facebook\nC. The salesperson\u0027s login with Facebook has expired\nD. None of his Facebook contacts have confirmed the nature of their relationship","definition":"B. The administrator hasn\u0027t enabled Social Contacts for Facebook","rank":161},{"id":"4714639490","term":"A System Administrator can modify the permission of both standard and custom profiles.\n\nA. False\nB. True","definition":"A","rank":36},{"id":"4714625795","term":"A user\u0027s profile controls which of the following items. (4 apply.)\n\nA. Language of the User Interface\nB. Login Hours and IP Ranges\nC. Available Record Types\nD. Fields that the user may be edited\nE. Applications that may be used\nF. Manager assigned to the user","definition":"B, C, D, E","rank":26},{"id":"4714623753","term":"A user has not been granted field-level access to a field on a custom object. A field update will fail if the user executes Apex logic that attempts to modify that field.\n\nA. False\nB. True","definition":"A","rank":23},{"id":"6826129267","term":"A Visualforce page has a standard controller for an object that has a lookup relationship to a parent object.\nHow can a developer display data from the parent record on the page?\n\nA. By using SOQL on the Visualforce page to query for data from the parent record.\nB. By using merge field syntax to retrieve data from the parent record.\nC. By adding a second standard controller to the page for the parent record.\nD. By using a roll-up formula field on the child record to include data from the parent record.","definition":"B. By using merge field syntax to retrieve data from the parent record.","rank":78},{"id":"8137994080","term":"A Visualforce page has a standard controller for an object that has a lookup relationship to a parent object. How can a developer display data from the parent record on the page?\nA.\n\nBy adding a second standard controller to the page for the parent record.\nB.\n\nBy using a roll-up formula field on the child record to include data from the parent record.\nC.\n\nBy using SOQL on the Visualforce page to query for data from the parent record.\nD.\n\nBy using merge field syntax to retrieve data from the parent record.","definition":"By using merge field syntax to retrieve data from the parent record.","rank":25},{"id":"8109313305","term":"A visualforce page has a standard controller for an object that has a lookup to the parent object. How can a developer display data from parent record on the page?\n\nA. By adding a second standard controller to the page for the parent record\nB. By using SOQL on the Visualforce page to query for data from the parent record\nC. By using merge field syntax to retrieve data from the parent record\nD. By using a roll-up formula field on the child record to include data from the parent record","definition":"C. By using merge field syntax to retrieve data from the parent record","rank":56},{"id":"8109568484","term":"By using which tool can the developer change the data model of a Salesforce organization?\n\nA. Data loader\nB. Administrator setup\nC. Cloud based data wizard\nD. Other","definition":"B. Administrator setup","rank":134},{"id":"8109262597","term":"Contact c \u003d [Select id, firstname, lastname, email from Contact where lastname\u003d\u0027Smith\u0027];\n\nWhat does query return if there is no Contact with the last name \u0027Smith\u0027\n\nA. An error that no rows are found\nB. A contact with empty\nC. A contact initialized to null\nD. An empty List of Contacts","definition":"A. An error that no rows are found","rank":45},{"id":"8108996781","term":"Custom lighting record page can be assigned to which three items?\n\nA. Record Types\nB. Apps\nC. Profiles\nD. Public group\nE. Roles","definition":"A. Record Types\nB. Apps\nC. Profiles","rank":8},{"id":"4714612850","term":"Custom objects on the \"detail\" side of a master-detail relationship cannot have sharing rules.\n\nA. True\nB. False","definition":"A","rank":13},{"id":"8109673142","term":"Dashboard refresh can be monitored using:\n\nA. Apex jobs\nB. Scheduled jobs\nC. Dashboard jobs\nD. Report jobs","definition":"B. Scheduled jobs","rank":135},{"id":"8090349937","term":"Describe the ramifications of field updates and potential for recursion for the following scenario: If a field update for Rule1 triggers Rule2, and a field update for Rule2 triggers Rule1.\nA. The updates create a loop and the org limits for workflow time triggers per hour will likely be violated.\nB. When the second trigger is saved a Imminent Loop Error message will be displayed and the workflow rule update will not save.\nC. The updates create a loop and the org will be blocked until the admin resolves the issue.\nD. Loop is allowed to run 25 times within one hour. If it does not end on its own the process will be stopped by R\u0026D.","definition":"A. The updates create a loop and the org limits for workflow time triggers per hour will likely be violated.","rank":148},{"id":"8089747411","term":"Developer needs to automatically populate the ReportsTo field in a Contact record based on the values of the related Account and Department fields in the Contact record.\nWhich type of trigger would the developer create?\nChoose 2 answers\nA. before update \nB. after insert\nC. before insert \nD. after update","definition":"A. before update C. before insert","rank":31},{"id":"8090287601","term":"Developer need to verify that the account trigger is working fine without changing Org data. What should the developer do to test the Account trigger?\nA. Use New button on Account tab to create new record\nB. Use the test menu on developer console to run all test classes for the account trigger. \nC. Use force.com IDE\nD. Use Execute Anonymous feature on developer console","definition":"B. Use the test menu on developer console to run all test classes for the account trigger.","rank":137},{"id":"8109374195","term":"Developer need to verify that the account trigger is working fine without changing Org data. What would the developer do to test the Account trigger? (Choose 2)\n\nA. Use the test menu on developer console to run all test classes for the account trigger.\nB. Use Execute Anonymous feature on developer console\nC. Use New button on Account tab to create new record \nD. Use force.com IDE","definition":"A. Use the test menu on developer console to run all test classes for the account trigger.\nD. Use force.com IDE","rank":72},{"id":"8109499432","term":"Each setSavepoint() and rollback statement counts against the total number of DML statements.\n\nA. True\nB. False","definition":"A. True","rank":112},{"id":"4714624607","term":"Field level security takes precedence over Object level security.\n\nA. False\nB. True","definition":"B","rank":25},{"id":"8090293233","term":"Field type conversion. Which of the following are true? (choose 2)\nA. Data can be lost when converting from autonumber to text\nB. Information can be lost when converting from text area (rich) to text area (long)\nC. Data can be lost when converting from number to currency (assuming that field lengths are identical)\nD. Data can be lost when converting from simple picklist to multi picklist","definition":"A. Data can be lost when converting from autonumber to text\nC. Data can be lost when converting from number to currency (assuming that field lengths are identical)","rank":139},{"id":"8109084233","term":"For how many days will the \"Quick Deploy\" option appear after a Change Set is successfully validated?\n\nA. 10\nB. 15\nC. 4\nD. 30","definition":"A. 10","rank":25},{"id":"8109029740","term":"From where can you select and run Apex Test in the Lightning Experience?\n\nA. Apex Test Execution page in Setup\nB. Testing API Page in Setup\nC. Apex Test History page in Setup\nD. Test menu in the Developer Console\nE. Apex Hammer Execution Status page in Setup","definition":"A. Apex Test Execution page in Setup\nD. Test menu in the Developer Console","rank":14},{"id":"6941328578","term":"Given the traditional FOR loop standard syntax:\n\nfor(initialization; exit_condition; increment){\n statement(s)\n}\n\nHow does the for-loop sequentially perform its operation?\n\nI. The initialization expression initializes the loop; it is executed once.\nII. The code block will be executed\nIII. Evaluate the exit_condition. If true, the loop continues. If false, the loop exits.\nIV. Execute the increment statement and evaluate the exit_condition again.\n\nA. I, II, IV, III\nB. I, III, II, IV\nC. I, II, III, IV\nD. III, I, II, IV","definition":"B. I, III, II, IV","rank":150},{"id":"8109402169","term":"How Can a developer avoid exceeding governor limits when using an apex Trigger? Choose 2\nA. By using Maps to hold data from query results\nB. By using a helper class that can be invoked from multiple triggers\nC. By performing DML transactions on lists of sObjects\nD. By using the Database class to handle DML transactions","definition":"A. By using Maps to hold data from query results\nC. By performing DML transactions on lists of sObjects","rank":82},{"id":"8109123887","term":"How can a developer determine, from the DescribeSobject, if the current user will be able to create record on an object in Apex?\n\nA. By using the isCreatable() method\nB. By using the hasAccess() method\nC. By using the canCreatable() method\nD. By using the isInsertable() method","definition":"A. By using the isCreatable() method","rank":34},{"id":"6826275361","term":"How can a developer determine, from the DescribeSObjectResult, if the current user will be able to create record... an object in Apex?\n\nA. By using the hasAccess() method.\nB. By using the isCreatable() method.\nC. By using the isInsertable() method.\nD. By using the canCreate() method.","definition":"B. By using the isCreatable() method.","rank":103},{"id":"8137565294","term":"How can a developer determine, from the DescribeSObjectResult, if the current user will be able to create records for an object in Apex?\nA.\n\nA. By using the isInsertable() method.\nB.\n\nB. By using the isCreatable() method.\nC.\n\nC. By using the hasAccess() method.\nD.\n\nD. By using the canCreate() method.","definition":"B. By using the isCreatable() method.","rank":11},{"id":"8109424658","term":"How can a developer refer to, or instantiate, a PageReference in Apex?\n\nA. By using a PageReference with a partial or full URL.\nB. By using the Page object and a Visualforce page name.\nC. By using the ApexPages.Page() method with a Visualforce page name.\nD. By using the PageReference.Page() method with a partial or full URL.","definition":"A. By using a PageReference with a partial or full URL.\nB. By using the Page object and a Visualforce page name.","rank":89},{"id":"6816971865","term":"How can a developer refer to, or instantiate a PageReference in Apex? Choose 2 answers\n\nA. By using a PageReference with a partial or full URL\nB. By using Page object and a Visualforce page name.\nC. By using the ApexPages.Page() method with a Visualforce page name.\nD. By using the PageReference.Page() method with a partial or full URL.","definition":"A. By using a PageReference with a partial or full URL\n\nB. By using Page object and a Visualforce page name.","rank":26},{"id":"8108935068","term":"How can a validity check be performed on a component?\n\nA. cmp.get() \u003d\u003d true\nB. cmp.get(\"v.isValid\") \u003d\u003d true\nC. cmp.get() !\u003d null\nD. cmp.get(\"v.isValid\") !\u003d null","definition":"C. cmp.get() !\u003d null","rank":0},{"id":"8109025236","term":"How can you make an External Object searchable via SOSL?\n\nA. Request a custom index from Salesforce Support\nB. Enable the \"Allow Search\" checkbox on the object\nC. Use the Search.QueryExternal() method\nD. Enable the \"Is Searchable\" checkbox on the object","definition":"B. Enable the \"Allow Search\" checkbox on the object","rank":13},{"id":"8108972216","term":"How do the CSS enhancement to the Lightning Design System improve the developer experience?\n\nA. Class names are abbreviated to reduce code length.\nB. Class names are available in upper and lower case.\nC. Uppercase is used to distinguish from custom class names.\nD. Single underscores (dashes) are used in class names to enable commenting Salesforce Lightning.","definition":"D. Single underscores (dashes) are used in class names to enable commenting Salesforce Lightning.","rank":3},{"id":"8109884787","term":"How would a developer change the field type of a custom field on account object from a string to an integer?\n\nA. Make the change in the declarative UI, then update the field type to an integer field in-the apex code. \nB. Remove all references in the code, make the change in the declarative UI, and restore the references with the new type.\nC. Make the change in the developer console, and then the change will automatically be reflected in the apex.\nD. Make the change in the declarative UI, and then the change will automatically be reflected in the apex code","definition":"B. Remove all references in the code, make the change in the declarative UI, and restore the references with the new type.","rank":179},{"id":"6826163879","term":"How would a developer determine if a co__c created has been manually shared within the current user in APEX?\n\nA. by calling the profile settings of the current user.\nB. By querying co__share\nC. By querying the role heirarchy\nD. By calling the","definition":"B. By querying co__share","rank":84},{"id":"8109455500","term":"How would a developer determine if a CustomObject__c record has been manually shared with the current user in Apex?\n\nA. By calling the profile settings of the current user\nB. By calling the isShared() method for the record\nC. By querying CustomObject__share\nD. By querying the role hierarchy.","definition":"C. By querying CustomObject__share","rank":97},{"id":"8109290587","term":"How would a developer use Schema builder to delete a custom field from the Account object that was required for prototyping but is no longer needed?\n\nA. Delete the field from Schema Builder and then all references in the code will be removed.\nB. Mark the field for deletion in Schema Builder and then delete it from the declarative UI.\nC. Remove all references from the code and then delete the custom field from Schema Builder\nD. Remove all the references in the code and then the field will be removed from Schema Builder","definition":"C. Remove all references from the code and then delete the custom field from Schema Builder","rank":51},{"id":"8090444019","term":"Identify the field update limitations. (choose three)\nA. Read-only fields like formula or auto-number fields aren\u0027t available for field updates.\nB. The results of a field update can\u0027t trigger additional rules such as validation, assignment, auto-response, or escalation rules.\nC. In a batch update, workflow is retriggered on all entities where there is a change\nD. Field updates that are executed as approval actions don\u0027t trigger workflow rules.","definition":"A. Read-only fields like formula or auto-number fields aren\u0027t available for field updates.\nC. In a batch update, workflow is retriggered on all entities where there is a change\nD. Field updates that are executed as approval actions don\u0027t trigger workflow rules.","rank":178},{"id":"8109896020","term":"Identify the standard Lightning components.\n\nA. List View\nB. Dashboards\nC. Rich Text\nD. Visualforce Page\nE. Reports","definition":"A. List View\nC. Rich Text\nD. Visualforce Page","rank":181},{"id":"8090425121","term":"Identify the standard Lightning components. (choose three)\nA. List View\nB. Dashboards\nC. Rich Text\nD. Visualforce Page \nE. Reports","definition":"C.RichText\nD. Visualforce Page E. Reports","rank":173},{"id":"4714631863","term":"If an Administrator removes access from a profile to use an Application, users with that profile will no longer have access to Tabs that Application contained.\n\nA. True\nB. False","definition":"B","rank":31},{"id":"8109744176","term":"In an organisation that has enabled multiple currencies, a developer needs to aggregate the sum of the Estimated_value__c currency field from the CampaignMember object using a roll-up summary field called Total_estimated_value__c on Campaign. How is the currency of the Total_estimated_value__c roll-up summary field determined?\n\nA. The values in CampaignMember.Estimated_value__c are converted into the currency of the Campaign record, and the sum is displayed using the currency on the Campaign record\nB. The values in CampaignMember.Estimated_value__c are converted into the currency of the current user, and the sum is displayed using the currency on the Campaign record\nC. The values in CampaignMember.Estimated_value__c are converted into the currency on teh majority of the CampaignMember records and the sum is displayed using that currency\nD. The values in CampaignMember.Estimated_value__c are summed up and the resulting Total_estimated_value__c field is displayed as a numeric field on the Campaign record","definition":"A. The values in CampaignMember.Estimated_value__c are converted into the currency of the Campaign record, and the sum is displayed using the currency on the Campaign record","rank":149},{"id":"6816843130","term":"In an organization that has enabled multiple currencies, a developer needs to aggregate sum of the Estimated_value__c currency field from the CampaignMember object using a roll-up summary field called Total_Estimate_Value__c field on Campaign.\n\nHow is the currency of the Total_Estimate_Value__c roll-up summary field determined?\n\nA. The values in the CampaignMember. Estimated_value__c are converted into the currency of the Campaign record, and the sum is displayed using the currency on the Campaign record.\nB. The values in the CampaignMember. Estimated_value__c are converted into the currency on the majority of CampaignMember records and the sum is displayed using that currency\n4\nC. The values in the CampaignMember. Estimated_value__c are summed up and the resulting Total_Estimated_Value__c field is displayed as a numeric field on the Campaign record.\nD. The values in the CampaignMember. Estimated_value__c are converted into the currency of the current user, and the sum is displayed using the currency on the Campaign record.","definition":"A. The values in the CampaignMember. Estimated_value__c are converted into the currency of the Campaign record, and the sum is displayed using the currency on the Campaign record.","rank":13},{"id":"8089138567","term":"In an organization that has enabled multiple currencies, a developer needs to aggregate the sum of the Estimated_value__c currency field from the CampaignMember object using a roll-up summary field called Total_estimated_value__c on Campaign.\nHow is the currency of the Total_estimated_value__c roll-up summary field determined?\nA. The values in Campaignmember.Estimated_value__c are converted into the currency of the Campaign record and the sum is displayed using the currency on the Campaign record.\nB. The values in CampaignMember.Estimated_value__c are converted into the currency on the majority of the CampaignMember records and the sum is displayed using that currency.\nC. The values in CampaignMember.Estimated_value__c are summed up and the resulting Total_estimated_value__c field is displayed as a numeric field on the Campaign record.\nD. The values In CampaignMember.Estimated_value__c are converted into the currency of the current user, and the sum is displayed using the currency on the Campaign record.","definition":"A. The values in Campaignmember.Estimated_value__c are converted into the currency of the Campaign record and the sum is displayed using the currency on the Campaign record.","rank":14},{"id":"6826245204","term":"In a single record, a user selects multiple-values from a multi-select picklists.\n\nHow are the selected values represented in Apex?\n\nA. As a String with each value separated by a comma.\nB. As a List\u003cString\u003e with each value as an element in the list\nC. As a String with each value separated by a semicolon.\nD. As a Set\u003cString\u003e with each value as an element in the Set.","definition":"C. As a String with each value separated by a semicolon.","rank":97},{"id":"8090152985","term":"In a single record, a user selects multiple values from a multi-select picklist.\nHow are the selected values represented in Apex?\nA. As a String with each value separated by a comma.\nB. As a List\u003cString\u003e with each value as a element in the list.\nC. As a String with each value separated by semi colon.\nD. As a Set\u003cString\u003e with each value as a element in the set.","definition":"C. As a String with each value separated by semi colon.","rank":95},{"id":"8137141806","term":"In a single record, a user selects multiple values from a multi-select picklist. How are the selected values represented in Apex?\n\nA. As a String with each value separated by a comma\n\nB. As a Set with each value as an element in the set\n\nC. As a String with each value separated by a semicolon\n\nD. As a List with each value as an element in the list Previous","definition":"C. As a String with each value separated by a semicolon","rank":0},{"id":"8109194791","term":"In a single record , a user selects multiple values from a multi select picklist. How are the values represented in Apex.\n\nA. As a List with each value as an element in the list\nB. As a Set with each value as an element in the set\nC. As a String with each value separated by a semicolon\nD. As a String with each value separated by a comma","definition":"C. As a String with each value separated by a semicolon","rank":40},{"id":"6826225478","term":"In Lightning component framework, which resource can be used to fire events? Choose 2 answers.\n\nA. Visualforce controller actions\nB. Third-party web service code\nC. Third-party Javascript code\nD. Javascript controller actions","definition":"C. Third-party Javascript code\nD. Javascript controller actions","rank":94},{"id":"8109771769","term":"In MVC, data model refers to?\n\nA. Custom tabs\nB. Custom fields\nC. Workflow rules","definition":"B. Custom fields","rank":156},{"id":"8090379230","term":"In order to create an App Launcher component in lightning what must an admin do?\nA. Navigate to Setup-Customize-User Interface to enable the component for the Lightning App Builder.\nB. Contact Salesforce to have the component activated for the Lightning App Builder.\nC. Purchase a license for the Lightning App Builder. D. Join the pilot Lightning App Builder team","definition":"B. Contact Salesforce to have the component activated for the Lightning App Builder.","rank":156},{"id":"8109082103","term":"In Process Builder, how can you make a process reusable and invoke it from other processes or action groups in the same process?\n\nA. Check the Invocable Process checkbox option\nB. Reference the process from an Apex method annotated with @InvocableMethod\nC. No configuration is required because all processes become invocable in Winter \u002717\nD. Select \"It\u0027s invoked by another process\" from the \"The process starts when\" picklist","definition":"D. Select \"It\u0027s invoked by another process\" from the \"The process starts when\" picklist","rank":24},{"id":"6816781376","term":"In the code below, what type does Boolean inherit from?\nBoolean b \u003d true;\n\nA. Enum\nB. Object\nC. String\nD. Class","definition":"B. Object","rank":6},{"id":"8109463299","term":"In the given code, from where does the Boolean inherit its value? _x000D_Boolean b \u003d true;\n\nA. Class\nB. Object\nC. Enum\nD. String","definition":"B. Object","rank":100},{"id":"8109841255","term":"In the Lightning Component framework, where is client-side controller logic contained?\n\nA. Apex\nB. Visualforce\nC. HTML\nD. JavaScript","definition":"D. JavaScript","rank":174},{"id":"8109255141","term":"In the lightning component framework, which resource can be used to fire events?\n\nA. Third-party Javascript code.\nB. Visualforce controller actions.\nC. Javascript controller actions.\nD. Third-party web service code.","definition":"A. Third-party Javascript code.\nC. Javascript controller actions.","rank":43},{"id":"8109457987","term":"In which of the following environments can Developers write code? Select all that apply.\n\nA. Developer edition production org\nB. Enterprise edition production org\nC. Enterprise edition Sandbox org\nD. Professional edition Sandbox org","definition":"A. Developer edition production org\nC. Enterprise edition Sandbox org","rank":98},{"id":"8109409231","term":"In Which order does Salesforce execute events upon saving a record?\n\nA. Before Triggers, Validation rules, After Triggers, Assignment Rules, Workflow Rules, Commit\nB. Before Triggers, Validation rules, After Triggers, Workflow Rules, Assignment Rules, Commit\nC. Validation rules, Before Triggers, After Triggers, Workflow Rules, Assignment Rules, Commit\nD. Validation rules, Before Triggers, After Triggers, Assignment Rules, Workflow Rules, Commit","definition":"A. Before Triggers, Validation rules, After Triggers, Assignment Rules, Workflow Rules, Commit","rank":84},{"id":"8135648437","term":"In which two ways does Lightning Data Service (LDS) eliminate redundant server calls in Lightning Components? Choose 2\n\nA. LDS identifies requests that involve the same record data and sends a single shared data request that updates all relevant components.\nB. LDS allows each component within an app to make independent, but concurrent, calls to perform CRUD operations on the same record data.\nC. LDS can be configured as a publisher hub with simple Apex code.\nD. LDS acts as a publisher hub that notifies components of data changes.","definition":"A. LDS identifies requests that involve the same record data and sends a single shared data request that updates all relevant components.\n\nD. LDS acts as a publisher hub that notifies components of data changes","rank":184},{"id":"8135652590","term":"In which two ways does Salesforce DX facilitate source-driven development? Choose 2\n\nA. A. Salesforce DX provides an efficient, end-to-end life cycle designed for waterfall development.\nB. Salesforce DX provides an integrated, end-to-end life cycle designed for high-performance agile development.\nC. Salesforce DX allows agile, local test runs.\nD. Salesforce DX shifts the source of truth from the org to the version control system","definition":"B. Salesforce DX provides an integrated, end-to-end life cycle designed for high-performance agile development.\n\nD. Salesforce DX shifts the source of truth from the org to the version control system","rank":189},{"id":"4714622735","term":"It is possible to copy settings from an existing profile when creating a new profile.\n\nA. True\nB. False","definition":"A","rank":21},{"id":"8109069613","term":"Name two required steps for enabling debug logging for unauthenticated Guest Users accessing public Sites. Choose 2 answers\n\nA. Set the \"Assigned Users\" in the Site \"Public Access Settings\" to include the built-in Debug User\nB. Install the Sites Page Inspector plugin for Chrome\nC. Check the \"Enable Guest Access Logging\" checkbox option in Site Details\nD. Set a browser cookie with a name value of \"debug_logs\" and a domain value of \".force.com\"\nE. Setup a new Trace Flag with a Traced Entity Type of \u0027User\u0027 that looks up to the Guest User for a Site","definition":"D. Set a browser cookie with a name value of \"debug_logs\" and a domain value of \".force.com\"\nE. Setup a new Trace Flag with a Traced Entity Type of \u0027User\u0027 that looks up to the Guest User for a Site","rank":21},{"id":"8090309473","term":"Objects of this Apex class allow developers to create list controllers similar to, or as extensions of,\nthe pre-built Visualforce list controllers provided by Salesforce.\nA. StandardSetController Class \nB. StandardController Class\nC. Controller Class\nD. VisualforceSetController Class \nE. VisualforceControllerClass\nF. None of the above","definition":"A. StandardSetController Class","rank":142},{"id":"8109882138","term":"Objects of this Apex class allow developers to create list controllers similar to, or as extensions of, the pre-built Visualforce list controllers provided by Salesforce.\n\nA. StandardSetController Class\nB. StandardController Class\nC. Controller Class\nD. VisualforceSetController Class\nE. VisualforceControllerClass\nF. None of the above","definition":"A. StandardSetController Class","rank":178},{"id":"8109476785","term":"On a Visualforce page with a custom controller, by using an ID parameter that is passed in the URL, how should a developer retrieve a record? Select all that apply.\n\nA. Use the constructor method for the controller\nB. Use the $Action.View method in the Visualforce page\nC. Use the \u003capex:detail\u003e tag in the Visualforce page\nD. Create a new PageReference object with the Id","definition":"A. Use the constructor method for the controller","rank":104},{"id":"6824368549","term":"On a Visualforce page with a custom controller, how should a developer retrieve a record by using an ID parameter that is passed on the URL?\n\nA. Use the constructor method for the controller.\nB. Use the $Action.View method in the Visualforce page.\nC. Create a new PageReference object with the Id.\nD. Use the \u003capex:detail\u003e tag in the Visualforce page","definition":"A. Use the constructor method for the controller.","rank":57},{"id":"8090042905","term":"On a Visualforce page with a custom controller, how should a developer retrieve a record by using an ID that is passed on the URL?\nA. Use the constructor method for the controller.\nB. Use the $Action.View method in the Visualforce page. \nC. Create a new PageReference object with the Id.\nD. Use the \u003capex:detail\u003e tag in the Visualforce page.","definition":"A. Use the constructor method for the controller.","rank":58},{"id":"8109319864","term":"On which object can an admin create a roll up summary field?\n\nA. Any object that is on the master side of a master-detail relationship.\nB. Any object that is on the parent side of a lookup relationship.\nC. Any object that is on the detail side of a master-detail relationship.\nD. Any object that is on the child side of a lookup relationship.","definition":"A. Any object that is on the master side of a master-detail relationship.","rank":58},{"id":"6826096283","term":"On which object can an administrator create a roll-up summary field?\n\nA. Any object that is on the master side of a master-detail relationship.\nB. Any object that is on the parent side of a lookup relationship.\nC. Any object that is on the detail side of a master-detail relationship.\nD. Any object that is on the child side of a lookup relationship.","definition":"A. Any object that is on the master side of a master-detail relationship.","rank":76},{"id":"4714630989","term":"Profile A that has authority to Read, Create, and Edit a custom object. Profile B that has Modify All access to a Custom object. Which of the following statements are true. (3 apply.)\n\nA. A user with Profile B cannot create new records.\nB. A user with Profile A cannot change record ownership to a user with Profile B.\nC. A user with Profile B can only edit records they own.\nD. A user with Profile B cannot change record ownership to a user with Profile A.\nE. A user with Profile A can edit records that they own.\nF. A user with Profile B can delete records they own.","definition":"A, E ,F","rank":30},{"id":"8089780535","term":"public class customController { public string cString { get; set;}\npublic string getStringMethod1(){ return cString;\n}\npublic string getStringMethod2(){ if(cString \u003d\u003d null)\ncString \u003d \u0027Method2\u0027;\nreturn cString;\n} }\n\u003capex:page controller\u003d\"customController\"\u003e\n{!cString}, {!StringMethod1}, {!StringMethod2}, {!cString} \u003c/apex:page\u003e\n\nWhat does the user see when accessing the custom page?\n\nA. getMyString,\nB. , , Method2,\nC.Method2, getMyString\nD. getMyString Method2, getMyString","definition":"B. , , Method2,","rank":36},{"id":"4714641750","term":"Roll-Up summary fields can SUM numeric fields of objects that are related with a lookup relationship.\n\nA. True\nB. False","definition":"B","rank":39},{"id":"4714622382","term":"Select the statements that are true about Cross-Object formula fields. (2 apply.)\n\nA. They can be used to delete child objects.\nB. They can be used when creating default field values.\nC. They can reference fields on parent or grandparent objects (up to 10 relationships away)\nD. They can be used to display fields of related objects on detail pages, list views, and reports.","definition":"C, D","rank":20},{"id":"4714617193","term":"Standard picklist fields can be controlling or dependent?\n\nA. True\nB. False","definition":"B","rank":18},{"id":"6924787378","term":"The Review_c object has a lookup relationship up to the Job_Application_c object. The job_Application_c object has a master-detail relationship up to the Position_ object. The relationship field names are based on the auto-populated defaults What is the recommended way to display field data from the related Review_c records on a Visualforce for a single Position_c record?\n\nA. Utilize the Standard Controller for Position_c and cross-object Formula Fields on the Job_Application c object to display Review_c data.\nB. Utilize the Standard Controller for Position_c and a Controller Extension to query for Review _C data.\nC. Utilize the Standard Controller for Position_c and expression syntax in the Page to display related Review c data through the Job_Application_c object.\nD. Utilize the Standard Controller for Position_c and cross-object Formula Fields on the Review_c object to display Review_c data.","definition":"B","rank":119},{"id":"8089832309","term":"The Review_c object have a lookup relationship to the job_Application_c object. The job_Application_c object has a master detail relationship up to the position_c object. The relationship is based on the auto populated defaults?\nWhat is the recommended way to display field data from the related Review _C records a Visualforce page for a single Position_c record?\nSelect one of the following:\nA. Utilize the Standard Controller for Position_c and cross-object Formula Fields on the Job_Application_c object to display Review_c data.\nB. Utilize the Standard Controller for Position_c and a Controller Extension to query for Review_c data.\nC. Utilize the Standard Controller for Position_c and expression syntax in the Page to display related Review_c through the Job_Applicacion_c inject.\nD. Utilize the Standard Controller for Position_c and cross-object Formula Fields on the Review_c object to display Review_c data.","definition":"D. Utilize the Standard Controller for Position_c and cross-object Formula Fields on the Review_c object to display Review_c data.","rank":46},{"id":"8109486223","term":"The Review__c object has a lookup relationship with the Job_Application__c object. The Job_Application__c object has a master-detail relationship with the Position__c object. The relationship field names are based on the auto-populated defaults. What is the recommended way to display field data from the related Review__c records on a Visualforce page for a single Position__c record?\n\nA. Utilize the Standard Controller for Position__c and expression syntax in the Page to display related Review__c data through the Job_Application__c object\nB. Utilize the Standard Controller for Position__c and cross-object Formula Fields on the Job_Application__c object to display Review__c data\nC. Utilize the Standard Controller for Position__c and cross-object Formula Fields on the Review__c object to display Review__c data\nD. Utilize the Standard Controller for Position__c and a Controller Extension to query for Review__c data","definition":"D. Utilize the Standard Controller for Position__c and a Controller Extension to query for Review__c data","rank":107},{"id":"6824297068","term":"The Review__c object has a lookup relation up to the Job_Application__c object. The Job_Application__c object has a master-detail relationship up to the Position__c object. The relationship names are based on auto-populated defaults.\n\nWhat is the recommended way to display field data from the related Review__c records on a Visualforce page for a single Position__c record?\n\nA. Utilized the Standard Controller for Position__c and cross-object Formula fields on the Job_Application__c object to display Review__c data.\nB. Utilized the Standard Controller for Position__c and Controller Extension to query for Review__c data.\nC. Utilized the Standard Controller for Position__c and expression syntax in the page to display related Review__c data through the Job_Application__c object.\nD. Utilized the Standard Controller for Position__c and cross-object formula fields on the Review__c object to display Review__c data.","definition":"B. Utilized the Standard Controller for Position__c and Controller Extension to query for Review__c data.","rank":45},{"id":"6826089231","term":"The Sales Management team hires a new intern. The intern is not allowed to view Opportunities, but needs to see the Most Recent Closed Date of all child Opportunities when viewing an Account record.\n\nWhat would a developer do to meet this requirement?\n\nA. Create a Workflow rule on the Opportunity object that updates a field on the parent Account.\nB. Create a formula field on the Account object that performs a Max on the Opportunity Close Date field.\nC. Create a roll-up summary field on the Account object that performs a Max on the Opportunity Close Date field.\nD. Create a trigger on the Account object that queries the Close Date of the most recent Opportunities.","definition":"C. Create a roll-up summary field on the Account object that performs a Max on the Opportunity Close Date field.","rank":75},{"id":"8090099807","term":"The Sales Management team hires a new intern. The intern is not allowed to view Opportunities, but needs to see the Most Recent Closed Date of all child Opportunities when viewing an Account record.\nWhat would a developer do to meet this requirement?\nA. Create a Workflow Rule on the Opportunity object that updates a field on the parent Account.\nB. Create a formula field on the Account object that performs a MAX on the Opportunity Close Date field.\nC. Create a roll-up summary field on the Account object that performs a MAX on the Opportunity Close Date field\nD. Create a trigger on the Account object that queries the Close Date of the most recent Opportunities.","definition":"C. Create a roll -up summary field on the Account object that performs a MAX on the Opportunity Close Date field","rank":76},{"id":"8109411817","term":"The Sales Management team hires a new intern. The intern is not allowed to view Opportunities, but needs to see the Most Recent Closed Date of all child Opportunities when viewing an Account record. What would a developer do to meet this requirement?\n\nA. Create a Workflow Rule on the Opportunity object that updates a field on the parent Account.\nB. Create a formula field on the Account object that performs a MAX on the Opportunity Close Date field.\nC. Create a roll-up summary field on the Account object that performs a MAX on the Opportunity Close Date field\nD. Create a trigger on the Account object that queries the Close Date of the most recent Opportunities.","definition":"C. Create a roll-up summary field on the Account object that performs a MAX on the Opportunity Close Date field","rank":85},{"id":"8090177130","term":"The sales management team requires that the Lead Source field of the Lead record be populated when a Lead is converted.\nWhat would a developer use to ensure that a user populates the Lead Source field prior to converting a Lead?\nA. Process builder \nB. Validation rule \nC. Formula field\nD. Workflow rule","definition":"B. Validation rule","rank":104},{"id":"8109104035","term":"The sales management team requires that the Lead Source field of the Lead record be populated when a Lead is converted. What would a developer use to ensure that a user populates the LeadSource field prior to converting to a Lead?\n\nA. Validation rule\nB. Process builder\nC. Formula Field\nD. Workflow rule","definition":"A. Validation rule","rank":30},{"id":"6826279528","term":"The sales management team requires that the lead source field of the Lead record be populated when Lead is converted. What would a developer use to ensure that a user populates the Lead source field?\n\nA. Process builder\nB. Validation rule\nC. Formula field\nD. Workflow rule","definition":"B. Validation rule","rank":104},{"id":"8090419001","term":"To enable the Publisher Actions area on Page Layouts, navigate to:\nA. Setup | Customize | Feeds | Settings\nB. Setup | Customize | Chatter | Settings\nC. Setup | Customize | Actions | Settings\nD. Setup | Customize | \u003cObjects\u003e | Settings","definition":"B. Setup | Customize | Chatter | S e t t i ngs","rank":171},{"id":"6817004984","term":"To which data type in Apex a currency field automatically assigned?\n\nA. Integer\nB. Decimal\nC. Double\nD. Currency","definition":"B. Decimal","rank":32},{"id":"8089752740","term":"To which primitive data type in Apex is a currency field atomically as signed?\nA. Integer \nB. Decimal \nC. Double \nD. Currency","definition":"B. Decimal\nRef: https://developer.salesforce.com/docs/atlas.en-us.apexcode.meta / a pe x c ode / l a ngCon_ a pe x _ pr i m i t i v e s . ht m","rank":32},{"id":"8109362421","term":"To Which primitive data type in Apex is a currency field automatically assigned?\n\nA. Currency\nB. Integer\nC. Decimal\nD. Double","definition":"C. Decimal","rank":68},{"id":"8090264489","term":"Universal Container installs an unmanaged package. Which of the following are true? Choose 2.\nA. Tests are executed during deployment\nB. Unmanaged packages can be upgraded\nC. Unmanaged packages don\u0027t have a version number D. Unmanaged packages have a namespace prefix\nE. Components of unmanaged packages can be edited","definition":"C. Unmanaged packages don\u0027t have a version number\nE. Components of unmanaged packages can be edited","rank":129},{"id":"8090295686","term":"Universal Container is using assignment rules to distribute cases to regional teams. Which of the following are true?\nA. It is possible to have multiple active assignment rules \nB. Cases may be assigned to public groups (if configured) \nC. Cases may be assigned to queues (if configured)\nD. A workflow field update can be used instead","definition":"C. Cases may be assigned to queues (if configured)","rank":140},{"id":"8090269307","term":"Universal containers has a custom object \"service\" which has a lookup relationship to Account. Universal containers wants to enhance Salesforce1 with an action that allows account managers to enter a new service to an Account while looking at the account?\nA. Enter an object specific action to Service and put it in the Account Layout \nB. Enter an object specific action to Service and put it in the Service Layout \nC. Enter an object specific action to Account and put it in the Account Layout \nD. Enter an object specific action to Account and put it in the Service Layout","definition":"C. Enter an object specific action to Account and put it in the Account Layout","rank":131},{"id":"8090245171","term":"Universal containers has a custom object that has a N:M relationship with opportunityLineItem carrying price and amount information. In order to compute total amounts and total prices per Opportunity using Rollup summary fields, what field type will you use?\nA. Crossobject \nB. Lookup\nC. Master-Detail \nD. Junction","definition":"C. Master-Detail","rank":125},{"id":"8090250167","term":"Universal containers has a custom object that has a N:M relationship with opportunityLineItem carrying price and amount information. In order to compute total amounts and total prices per Opportunity using Rollup summary fields, what relationship type will you use?\nA. Crossobject \nB. Lookup\nC. Master-Detail \nD. Junction","definition":"D. Junction","rank":126},{"id":"8090333971","term":"Universal Containers has built a recruiting application with two custom objects, Job Applications\nand Reviews that have a master-detail relationship. Users should NOT be allowed to delete rev iew\nrecords after job application records have been approved.\nHow would a developer meet this requirement?\nA. Change the interviewer\u0027s profile to Read-only for the review object B. Use workflow to change the page layout to Read-only\nC. Remove the Delete button from the job application page layout\nD. Use a validation rule in conjunction with a roll-up summary field","definition":"D. Use a validation rule in conjunction with a roll-up summary field","rank":145},{"id":"8109731460","term":"Universal containers has included its orders as an external data object into Salesforce. You want to create a relationship between Accounts and the Orders object (one-to-many relationship) leveraging a key field for account which is on both external object and Account. Which relationship do you create:\n\nA. Indirect Lookup Relationship\nB. External Lookup Relationship\nC. Hierarchical Relationship\nD. Lookup Relationship\nE. Master-Detail Relationship","definition":"A. Indirect Lookup Relationship","rank":145},{"id":"8090241778","term":"Universal containers has included its orders as an external data object into Salesforce. You want to create a relationship between Accounts and the Orders object (one-to-many relationship) leveraging a key field for account which is on both external object and Account. Which relationship do you create?\nA. Master Detail Relationship\nB. Indirect Lookup Relationship \nC. Lookup Relationship\nD. Hierarchical Relationship\nE. External Lookup Relationship","definition":"B. Indirect Lookup\nRelationship","rank":124},{"id":"8109541594","term":"Universal Containers tracks reviews as a custom object in a recruiting application. The interview score is tracked on each review record and should have a numerical value, so that hiring managers can calculate scores. The scores should be restricted to integer values 1 through 5 and displayed as a set of radio buttons. How can a developer meet this requirement?\n\nA. Create the Interview score field as a picklist, displayed as a radio button on page layout\nB. Create a formula field that displays the interview score as a set of radio buttons\nC. Create the interview score field with a data type of radio button\nD. Create a Visualforce page to display the interview score as a set of radio buttons","definition":"D. Create a Visualforce page to display the interview score as a set of radio buttons","rank":125},{"id":"8109849949","term":"Universal containers want an org for development which can be refreshed in every 5 days with all the configuration and some data. What org do you choose?\n\nA. Developer Sandbox\nB. Developer Pro Sandbox\nC. Partial copy sandbox\nD. Full Sandbox","definition":"C. Partial copy sandbox","rank":176},{"id":"8109544565","term":"Universal Containers wants to create a custom order management application that allows users to enter order details such as the Product Name and Product Code. The application should be able to check if these values are consistent with the valid Product Name and Product Code combinations set up in a custom object. Which feature would a developer use to accomplish this?\n\nA. A validation rule with the REGEX function\nB. A formula field with the VALIDATE function\nC. A validation rule with the VLOOKUP function\nD. A formula field with the IF function","definition":"C. A validation rule with the VLOOKUP function","rank":126},{"id":"8090240068","term":"Universal containers wants to rollout new product bundles with several pricing options. Pricing options include product-price bundles, account specific pricing and more. Which product satisfies the needs?\nA. Workflow on Opportunity/Opportunity Product\nB. Custom Appexchange-app for product-pricing\nC. Formula fields on Opportunity/Opportunity Product D. Lightning process builder","definition":"B. Custom Appexchange-app for product- pricing","rank":123},{"id":"8090335955","term":"Universal Container want to store an area code and wants to be able to search for it in applications (apex). Which are possible fields to store the data? Choose 2\nA. Email\nB. Multi Picklist \nC. Text\nD. Number\nE. Phone","definition":"C. Text\nD. Number","rank":146},{"id":"8090266443","term":"Universal Container want to store an area code and wants to be able to search for it in searches. Which are possible fields to store the data? (choose 2)\nA. Phone\nB. Email\nC. Text\nD. Multi Picklist","definition":"A. Phone \nC. Text","rank":130},{"id":"4714624301","term":"Validation rules apply to new and updated records for an object, even if the fields referenced in the validation rule are not included in a page layout or an API call.\n\nA. True\nB. False","definition":"A","rank":24},{"id":"4714623180","term":"Validation rules don\u0027t apply if you create new records for an object with Quick Create.\n\nA. True\nB. False","definition":"A","rank":22},{"id":"8109469999","term":"Visualforce components are similar to which type of tag library containing tag namespace prefixes?\n\nA. ASP tag library\nB. JSP tag library\nC. ASP log file\nD. DL JSP log file","definition":"B. JSP tag library","rank":102},{"id":"8109816288","term":"What actions types should be configured to display a custom success message?\n\nA. Update a record.\nB. Post a feed item.\nC. Delete a record.\nD. Close a case.","definition":"A. Update a record.","rank":167},{"id":"8109811266","term":"What are the supported content sources for custom buttons and links?\n\nA. VisualForce Page\nB. Static Resource\nC. URL\nD. Chatter File\nE. Lightning Page","definition":"A. VisualForce Page\nC. URL","rank":166},{"id":"8108946830","term":"What are the two considerations when overriding standard actions? Choose 2 answers\n\nA. Overriding standard actions with a Lightning component applies only to Lightning Experience and Salesforce 1, but not to Salesforce Classic.\nB. Overriding standard actions with a Visualforce page applies only to Salesforce Classic and Lightning Experience, but not to Salesforce1.\nC. Overriding standard actions with a Visualforce page applies to Salesforce Classic, Lightning Experience, and Salesforce1.\nD. Overriding standard actions with a Lightning component applies to Lightning Experience, Salesforce1, and Salesforce Classic.","definition":"A. Overriding standard actions with a Lightning component applies only to Lightning Experience and Salesforce 1, but not to Salesforce Classic.\n\nC. Overriding standard actions with a Visualforce page applies to Salesforce Classic, Lightning Experience, and Salesforce1.","rank":1},{"id":"4714598994","term":"What are three tiers of Salesforce platform? (3 apply)\n\nA.User Interface\nB. Data\nC. Training\nD. Business Logic\nE. Meta","definition":"A, B, D","rank":8},{"id":"8135650634","term":"What are two valid scenarios for automatic recompilation of Apex classes? Choose 2\n\nA. All Apex classes are automatically recompiled when Apex transactions are run.\nB. All Apex classes are automatically recompiled before a package is installed.\nC. Specific Apex classes are automatically recompiled before completing a metadata deploy.\nD. All Apex classes are automatically recompiled before completing a metadata deploy.","definition":"B. All Apex classes are automatically recompiled before a package is installed.\n\nD. All Apex classes are automatically recompiled before completing a metadata deploy.","rank":186},{"id":"8109075126","term":"What are two ways to use the Lightning Design System in Lightning Apps?\n\nA. Copy and paste CSS classes from Lightning Design System to the CSS resource in the Application Bundle\nB. Include an attribute with a name of \"SLDS\" of type \"Boolean\" that has a default value of true\nC. Extend \"force:slds\" in the \u003c aura:application \u003e tag\nD. Reference a Static Resource using \"ltng:require\"","definition":"C. Extend \"force:slds\" in the \u003c aura:application \u003e tag\nD. Reference a Static Resource using \"ltng:require\"","rank":22},{"id":"8090347350","term":"What can a lightning component contain in its resource bundle? Choose two answers.\nA. Custom Client-side rendering behavior. \nB. Properties files with global settings.\nC. CSS styles scoped to the component. \nD. Build scripts for minification.","definition":"A. Custom Client-side rendering behavior.\nC. CSS styles scoped to the component.","rank":147},{"id":"4714628261","term":"What can a Record Type control?\n\nA. Available picklist items\nB. Available Applications\nC. Page Layout\nD. Workflow rules\nE. Tab Settings","definition":"A, C","rank":28},{"id":"8109397529","term":"What can be used to insure data quality? (Choose 3)\n\nA. Validation Rules\nB. Page Layouts\nC. Require Fields\nD. Workflows\nE. Triggers","definition":"A. Validation Rules\nB. Page Layouts\nC. Require Fields","rank":80},{"id":"6824402437","term":"What declarative method helps ensure quality data? Choose 3 answers\n\nA. Exception handling\nB. Workflow alerts\nC. Validation rules\nD. Lookup filters\nE. Page layouts","definition":"C. Validation rules\nD. Lookup filters\nE. Page layouts","rank":63},{"id":"8090271097","term":"What determines whether a user can create a new record using a specific record type?\nA. Profile\nB. Page layout\nC. Field level security \nD. Sharing","definition":"A. Profile","rank":132},{"id":"4714628730","term":"What does the Salesforce.com sharing model determine? (3 apply.)\n\nA. Why they have access to records\nB. Which tabs they can access records through\nC. How records can be modified\nD. Who has access to records\nE. What level of access to records","definition":"A, D, E","rank":29},{"id":"4714615429","term":"What elements does a custom object automatically contain when it is created? (2 apply.)\n\nA. Standard Controller\nB. Queues\nC. Page Layout\nD. Field Sets\nE. Record Type","definition":"A, C","rank":16},{"id":"8109826917","term":"What features are available when writing apex test classes? Choose 2\n\nA. The ability to select error types to ignore in the developer console.\nB. The ability to write assertions to test after a @future method.\nC. The ability to set and modify the CreatedDate field in apex tests.\nD. The ability to set breakpoints to freeze the execution at a given point.\nE. The ability to select testing data using csv files stored in the system.","definition":"C. The ability to set and modify the CreatedDate field in apex tests.\nE. The ability to select testing data using csv files stored in the system.","rank":170},{"id":"8090278297","term":"What happens when a workflow is re-evaluated? Pick 3\nA. Validation\nB. Cross-object sharing rules \nC. Other Workflow types\nD. Previous Workflows","definition":"B. Cross-object sharing rules \nC. Other Workflow types\nD. Previous Workflows","rank":134},{"id":"8137444664","term":"What is a benefit of the lightning component framework?\nA.\n\nA. Better integration with Force.com sites\nB.\n\nB. Better performance for custom Salesforce1 Mobile Apps\nC.\n\nC. More Centralized control via server-side logic\nD.\n\nD. More pre-built components to replicate the salesforce look and feel","definition":"D. More pre-built components to replicate the salesforce look and feel","rank":8},{"id":"8109302098","term":"What is a capability of a standardSetController? (Choose 2)\n\nA. It allows pages to perform mass updates of records\nB. It enforces field-level security when reading large record sets\nC. It extends the functionality of a standard or custom controller\nD. It allows pages to perform pagination with large record sets","definition":"A. It allows pages to perform mass updates of records\nD. It allows pages to perform pagination with large record sets","rank":53},{"id":"6816916927","term":"What is a capability of cross-object formula field? Choose 3 answers.\n\nA. Formula fields can reference fields from mater-detail or lookup parent relationships.\nB. Formula fields can expose data the user does not have access to in the record\nC. Formula fields can be used in three roll-up summaries per object\nD. Formula fields can reference fields in a collection of records from a child relationship\nE. Formula fields can reference fields from object that are up to 10 relationships away.","definition":"A. Formula fields can reference fields from mater-detail or lookup parent relationships.\nB. Formula fields can expose data the user does not have access to in the record\nE. Formula fields can reference fields from object that are up to 10 relationships away.","rank":16},{"id":"8089148365","term":"What is a capability of cross-object formula fields? Choose 3 answers\nA. Formula fields can reference fields from master-detail or lookup parent relationships.\nB. Formula fields can expose data the user does not have\naccess to in a record.\nC. Formula fields can be used in three roll-up summaries per object.\nD. Formula fields can reference fields in a collect of records from a child relationship.\nE. Formula fields can reference fields from objects that are up to 10 relationships away.","definition":"A. Formula fields can reference fields lookup parent relationships.\nB. Formula fields can expose data the to in a record.\nE. Formula fields can reference fields 10 relationships away.\nfrom master-detail or\nuser does not have access from objects that are up to\n\nRef: https://help.salesforce.com/HTViewHelpDoc? id\u003dcustomize_cross_object.htm","rank":17},{"id":"8109445097","term":"What is a capability of cross-object formulas fields? Choose 3 answers\n\nA. Formula fields can reference fields from Master-Detail or lookup parent relationships\nB. Formula fields can reference fields in a collection of records from a child relationship\nC. Formula fields can be use in three roll-up summaries per object\nD. Formula fields can reference fields from objects that are up to 10 relationships away\nE. Formula fields can expose data the user does not have access to in a record","definition":"A. Formula fields can reference fields from Master-Detail or lookup parent relationships\nD. Formula fields can reference fields from objects that are up to 10 relationships away\nE. Formula fields can expose data the user does not have access to in a record","rank":94},{"id":"6824303872","term":"What is a capability of Force.com IDE? Choose 2 answers\n\nA. Roll back deployments\nB. Run Apex tests.\nC. Download debug logs.\nD. Edit metadata components","definition":"B. Run Apex tests.\nD. Edit metadata components","rank":46},{"id":"6826227398","term":"What is a capability of formula field? Choose 3 answers.\n\nA. Display a previous value for a field using the PRIORVALUE function\nB. Return and display a field value from another object using VLOOKUP function.\nC. Determine which of the three different images to display using IF function\nD. Generate a link using HYPERLINK function to a specific record in a legacy system.\nE. Determine if a datetime field has passed using the NOW function.","definition":"A. Display a previous value for a field using the PRIORVALUE function\nC. Determine which of the three different images to display using IF function\nE. Determine if a datetime field has passed using the NOW function.","rank":95},{"id":"8138011574","term":"What is a capability of formula fields? (Choose 3)\nA.\n\nGenerate a link using the HYPERLINK function to a specific record in a legacy system.\nB.\n\nDisplay the previous values for a field using the PRIORVALUE function.\nC.\n\nReturn and display a field value from another object using the VLOOKUP function.\nD.\n\nDetermine if a datetime field has passed using the NOW function.\nE.\n\nDetermine which of three different images to display using the IF function.","definition":"Generate a link using the HYPERLINK function to a specific record in a legacy system.\n\nDetermine if a datetime field has passed using the NOW function.\n\nDetermine which of three different images to display using the IF function.","rank":26},{"id":"8109439642","term":"What is a capability of the Developer Console?\n\nA. Execute Anonymous Apex Code, Run REST API, Deploy code changes\nB. Execute Anonymous Apex Code, Create/Edit Code, Deploy code changes\nC. Execute Anonymous Apex Code, Create/Edit Code, View Debug Logs\nD. Execute Anonymous Apex Code, Run REST API, Create/EDIT Code","definition":"C. Execute Anonymous Apex Code, Create/Edit Code, View Debug Logs","rank":92},{"id":"8109144812","term":"What is a capability of the Force.com IDE?\n\nA. Roll back deployments.\nB. Run Apex tests.\nC. Download debug logs.\nD. Edit metadata components.","definition":"B. Run Apex tests.\nD. Edit metadata components.","rank":39},{"id":"6816968021","term":"What is accurate statement about with sharing keyword? Choose 2 answers\n\nA. Inner classes do not inherit the sharing settings from the container class.\nB. Both inner and outer classes can be declared as with sharing.\nC. Either inner or outer classes can be declared as with sharing, but not both.\nD. Inner classes inherit the sharing settings from the container class.","definition":"A. Inner classes do not inherit the sharing settings from the container class.\n\nB. Both inner and outer classes can be declared as with sharing.","rank":25},{"id":"6816911399","term":"What is a characteristic of the Lightning Component framework? Choose 2 answers.\n\nA. It has an event-driven architecture.\nB. It works with existing Visualforce pages.\nC. It includes responsive components\nD. It uses XML as its data format","definition":"A. It has an event-driven architecture.\nC. It includes responsive components","rank":15},{"id":"8108977957","term":"What is a consideration for Locker Service Enablement?\n\nA. Locker Service is enabled for custom Lightning Components implementing the interface force:enforceLockerService\nB. Locker Service is enabled for all custom lightning components with API version 40.0 or greater.\nC. Locker Service is disabled for custom Lightning Components implementing the interface force:ignoreLockerService\nD. Locker Service is disabled for all custom Lightning Components, regardless of the API version.","definition":"B. Locker Service is enabled for all custom lightning components with API version 40.0 or greater.","rank":4},{"id":"8089705325","term":"What is a correct pattern to follow when programming in Apex on a Multi-tenant platform?\nA. Apex code is created in a separate environment from schema to reduce deployment errors.\nB. DML is performed on one record at a time to avoid possible data concurrency issues.\nC. Queries select the fewest fields and records possible to avoid exceeding governor limits.\nD. Apex classes use the \u0027\u0027with sharing\" keyword to prevent access from other server tenants.","definition":"C. Queries select the fewest fields and records possible to avoid exceeding governor limits.","rank":22},{"id":"8109348481","term":"What is a good practice for a developer to follow when writing a trigger?\n\nA. Using synchronous callouts to call external systems\nB. Using the Map data structure to hold query results by ID\nC. Using @future methods to perform DML operations\nD. Using the Set data structure to ensure distinct records","definition":"B. Using the Map data structure to hold query results by ID\nD. Using the Set data structure to ensure distinct records","rank":65},{"id":"8109366999","term":"What is a junction object?\n\nA. A custom object with one lookup relationship and one master-detail relationship.\nB. A custom object with two lookup relationships.\nC. A custom object with any number of lookup and master-detail relationships.\nD. A custom object with two master-detail relationships.","definition":"D. A custom object with two master-detail relationships.","rank":70},{"id":"8090435629","term":"What is a lightning page?\nA. A page you can access via a customer community. B. The new name for a Salesforce page layout.\nC. A custom layout for creating pages in Salesforce1. \nD. A compact, configurable, and reusable element","definition":"C. A custom layout for creating pages in Salesforce1.","rank":176},{"id":"8109522417","term":"What is an accurate construction for a custom controller named \u0027\u0027MyController\u0027\u0027?\n\nA. Public MyController() {_x000D_account \u003d new Account();_x000D_}\nB. Public MyController(SObject obj) {_x000D_account \u003d new (Account) obj;_x000D_}\nC. Public MyController(List\u003cSObject\u003e objects){_x000D_accounts \u003d (List\u003cAccount\u003e)objects;_x000D_}\nD. Public MyController(ApexPages.StandardController stdController){_x000D_account \u003d (Account)stdController.getRecord():_x000D_}","definition":"A. Public MyController() {_x000D_account \u003d new Account();_x000D_}","rank":119},{"id":"6824408860","term":"What is an accurate constructor for a custom controller named \"MyController\"?\n\nA. public MyController() {\naccount \u003d new Account();\n}\nB. public MyController(SObject obj) {\naccount \u003d (Account) obj;\n}\n\nC. public MyController(List\u003cSObject\u003e objects) {\naccounts \u003d (List\u003cAccount\u003e) objects;\n}\nD. public MyController(ApexPages.StandardController stdController) {\naccount \u003d (Account) stdController.getRecord();\n}","definition":"A. public MyController() {\naccount \u003d new Account();\n}","rank":64},{"id":"8109285403","term":"What is an accurate statement about the variable scope? Choose 3\n\nA. A variable can be defined at any point in a block\nB. Parallel blocks can use the same variable name\nC. Sub-blocks cannot reuse a parent block\u0027s variable name\nD. A static variable can restrict the scope to the current block if its values is null\nE. Sub-blocks can reuse a parent\u0027s block variable name if its value is null","definition":"A. A variable can be defined at any point in a block\nB. Parallel blocks can use the same variable name\nC. Sub-blocks cannot reuse a parent block\u0027s variable name","rank":50},{"id":"8090123246","term":"What is an accurate statement about variable scope? Choose 3 answers\nA. Sub -blocks cannot reuse a parent block\u0027s variable name.\nB. A variable can be defined at any point in a block.\nC. Parallel blocks can use the same variable name.\nD. Sub -blocks can reuse a parent block\u0027s variable name if its value is null.\nE. A static variable can restrict the scope to the current block if its value is null.","definition":"B. A variable can be defined at any point in a block.\nC. Parallel blocks can use the same variable name.\nA. Sub -blocks cannot reuse a parent block\u0027s variable name","rank":85},{"id":"8109422508","term":"What is an accurate statement about with sharing keyword?Choose 2\n\nA. Either inner or outer classes can be declared as with sharing, but no both\nB. Both inner and outer classes can be declared as with sharing\nC. Inner classes do not inherit the sharing setting from the container class\nD. Inner classes inherit the sharing setting from the container class","definition":"B. Both inner and outer classes can be declared as with sharing\nC. Inner classes do not inherit the sharing setting from the container class","rank":88},{"id":"6826221894","term":"What is an important consideration when developing in a multi-tenant environment?\n\nA. Polyglot persistence provides support for a global, multilingual user base in a multiple org on multiple instances.\nB. Governor limits prevent tenants from impacting performance in multiple orgs on the same instance.\nC. Unique domain names take the place of namespaces for code developed for multiple orgs on multiple instances.\nD. Org-wide data security determines whether other tenants can see data in multiple orgs on the same instance.","definition":"B. Governor limits prevent tenants from impacting performance in multiple orgs on the same instance.","rank":93},{"id":"8109258923","term":"What is an important consideration when developing in multitenant environment?\n\nA. Unique domain names take the place of namespace for code developed for multiple orgs on multiple instances.\nB. Org-wide data security determines whether other tenants can see data in multiple orgs on the same instance.\nC. Governor limits prevent tenants from impacting performance in multiple orgs on the\nsame instance\nD. Polyglot persistence provides support for a global, multilingual user base in multiple orgs in multiple instances","definition":"C. Governor limits prevent tenants from impacting performance in multiple orgs on the\nsame instance","rank":44},{"id":"8090142264","term":"What is an important consideration when in a multi-tenant environment?\nA. Polyglot persistance provides support for a global, multilingual user base in multiple orgs on multiple instances\nB. Governor limits prevent tenants from impacting performance in multiple orgs on the same instance\nC. Unique domain names takes the place of namespace for code developed for multiple orgs for multiple instances D.Org-wide data security determines whether other tenants can see data in multiple orgs on the same inst","definition":"B. Governor limits prevent tenants from impacting performance in multiple orgs on the same instance","rank":92},{"id":"6817332567","term":"What is a valid Apex statement?\n\nA. Map conMap \u003d [ SELECT name FROM Contact ];\nB. Account[] accList \u003d new List\u003cAccount\u003e{new Account()};\nC. Integer w, x, y \u003d 123, z \u003d \u0027abc\u0027;\nD. private static constant Double rate \u003d 7.75;","definition":"B. Account[] accList \u003d new List\u003cAccount\u003e{new Account()};","rank":36},{"id":"8090030119","term":"What is a valid source and destination pair that can send or receive change sets?\nChoose 2 answers:\nA. Sandbox to production.\nB. Developer edition to sandbox. C. Developer edition to production. D. Sandbox to sandbox.","definition":"A. Sandbox to production. D. Sandbox to sandbox.\nReason:\nThere\u0027s three basic combinations: production to sandbox, sandbox to sandbox, and sandbox to production. Any combination is allowed, so long as the orgs are configured to accept incoming change sets, and any sandboxes involved are created from the same production org.","rank":53},{"id":"8109315928","term":"What is a valid source and destination pair that send or receive change sets?\n\nA. Sandbox to Sandbox.\nB. Developer edition to production\nC. Developer edition to sandbox\nD. Sandbox to production.","definition":"A. Sandbox to Sandbox.\nD. Sandbox to production.","rank":57},{"id":"8109114381","term":"What is a valid statement about Apex Classes and interfaces? Choose 2\n\nA. Exception classes must end with the word exception\nB. The default modifier for a class is private\nC. A class can have multiple levels of inner class\nD. The default modifier for an interface is private","definition":"A. Exception classes must end with the word exception\nB. The default modifier for a class is private","rank":32},{"id":"8090221993","term":"What is a valid way of loading external JavaScript files into a Visualforce page? (Choose 2)\nA. Using an (apex:includeScript)* tag. \\\u003e B. Using an (apex:define)* tag.\nC. Using a (link)* tag.\nD. Using a (script)* tag.\n*For this question, replace ( ) with less/greater than symbols.","definition":"A. Using an (apex:includeScript)* tag. \nD. Using a (script)* tag.\n*For this question, replace ( ) with less/greater than s y m bol s .","rank":116},{"id":"8109203396","term":"What is capability of formula fields? Choose 3\n\nA. Determine if a datetime field has passed using the NOW function\nB. Determine which of three different images to display using IF function\nC. Display the previous value for a field using the PRIORVALUE function\nD. Return and display a field value from another object using the VLOOKUP function\nE. Generate a link using the HYPERLINK function to a specific record in a legacy system","definition":"A. Determine if a datetime field has passed using the NOW function\nB. Determine which of three different images to display using IF function\nE. Generate a link using the HYPERLINK function to a specific record in a legacy system","rank":42},{"id":"6816980001","term":"What is minimum log level needed to see user-generated debug statements?\n\nA. DEBUG\nB. FINE\nC. INFO\nD. WARN","definition":"A. DEBUG","rank":28},{"id":"6826345641","term":"What is the advantage of Salesforce Lightning\n\nA. Pre-defined components to give Standard Look and Feel\nB. Uses service side for better handling","definition":"A. Pre-defined components to give Standard Look and Feel","rank":107},{"id":"8109078024","term":"What is the benefit of the Lightning Component Framework?\n\nA. More pre-built components to replicate the Salesforce look and feel\nB. Better performance for custom Salesforce1 Mobile apps.\nC. More centralized control via server-side logic.\nD. Better integration with Force.com sites.","definition":"A. More pre-built components to replicate the Salesforce look and feel","rank":23},{"id":"8090155109","term":"What is the capability of Force.com IDE? Choose 2 answers\nA. Edit metadata components \nB. Run Apex tests\nC. Run debug logs\nD. Roll back deployments","definition":"A. Edit metadata components \nB. Run Apex tests\nRef: https://developer.salesforce.com/page/Force.com_IDE","rank":96},{"id":"8090148313","term":"What is the capability of formula fields? Choose 3 answers\nA. Display the previous value for the field using the PRIORVALUE function.\nB. Return and display a field value from another object using a VLOOKUP function.\nC. Determine which of three different images to display using IF function. D. Generate the link using the HYPERLINK function using a specific record in a legacy system.\nE. Determine if a datetime field has passed using the NOW function.","definition":"C. Determine which of three different images to display using IF function.\nD. Generate the link using the HYPERLINK function using a specific record in a legacy\nsystem.\nE. Determine if a datetime field has passed using the NOW function.\nRef: https://developer.salesforce.com/trailhead/en/point_click_business_logic/formula_fields\nVLOOKUP only available in validation rules","rank":94},{"id":"8135651274","term":"What is the correct annotation to indicate test classes that can run in parallel?\n\nA. @isTest(runParallel\u003dtrue)\nB. @isTest\nC. @isTest(isParallelrun\u003dtrue)\nD. @isTest(isParallel\u003dtrue)","definition":"D. @isTest(isParallel\u003dtrue)","rank":187},{"id":"8109099490","term":"What is the correct pattern to follow when programming in Apex on multitenant platform?\n\nA. Apex code is created in a separate environment from schema to reduce deployment errors.\nB. DML is performed on one record at a time to avoid possible data concurrency issues.\nC. Queries select the fewest fields and records possible to avoid exceeding governor limits.\nD. Apex classes use the \u0027\u0027with sharing\" keyword to prevent access from other server tenants.","definition":"C. Queries select the fewest fields and records possible to avoid exceeding governor limits.","rank":29},{"id":"6816949178","term":"What is the correct pattern to follow when programming in Apex on muti-tenant platform?\n\nA. Apex code is created in a separate environment from schema to reduce the deployment errors.\nB. DML is performed on one record at a time to avoid possible data concurrency issues.\nC. Queries select the fewer fields and records possible to avoid exceeding governor limits.\nD. Apex classes use the \"with sharing\" keyword to prevent access from server tenants","definition":"C. Queries select the fewer fields and records possible to avoid exceeding governor limits.","rank":21},{"id":"6922406456","term":"What is the correct way to describe how Model-View-Controller (MVC) architecture is\nimplemented on the Salesforce platform?\nChoose one answer\nA. Model: Standard and Custom Objects; View: Visualforce Pages; Controller: s-\nControls\nB. Model: Schema Builder; View: List Views; Controller: Setup Console\nC. Model: Standard and Custom Objects; View: Visualforce Pages; Controller: Apex\nCode\nD. Model: Apex Code; View: List Views; Controller: Setup Console","definition":"C","rank":112},{"id":"8109831358","term":"What is the correct way to describe how Model-View-Controller (MVC) architecture is implemented on the Salesforce platform?\n\nA. Model: Standard and Custom Objects; View: Visualforce Pages; Controller: s-Controls\nB. Model: Schema Builder; View: List Views; Controller: Setup Console\nC. Model: Standard and Custom Objects; View: Visualforce Pages; Controller: Apex Code\nD. Model: Apex Code; View: List Views; Controller: Setup Console","definition":"C. Model: Standard and Custom Objects; View: Visualforce Pages; Controller: Apex Code","rank":171},{"id":"8109823857","term":"What is the easiest (optimal) way to verify a user before showing them sensitive content?\n\nA. Sending the user a SMS message with a passcode.\nB. Calling the generateVerificationUrl method in apex.\nC. Sending the user an Email message with a passcode.\nD. Calling the Session.forcedLoginUrl method in apex.","definition":"B. Calling the generateVerificationUrl method in apex.","rank":169},{"id":"8090191739","term":"What is the easiest way to verify a user before showing them sensitive content?\nA. Sending the user a SMS message with a passcode. B. Calling the generateVerificationUrl method in apex.\nC. Sending the user an Email message with a passcode. \nD. Calling the Session.forcedLoginUrl method in apex.","definition":"B. Calling the generateVerificationUrl method in apex.","rank":109},{"id":"4714602522","term":"What is the impact of changing the Local?\n\nA. Time Zone\nB. Date Format\nC. Currency\nD. Language\nE. Business Hour","definition":"B","rank":9},{"id":"8109499135","term":"What is the minimum log level needed to see user-generated debug statements?\n\nA. INFO\nB. FINE\nC. WARN\nD. DEBUG","definition":"D. DEBUG","rank":111},{"id":"8089740243","term":"What is the minimum log level needed to see user generated debug statements?\nA. DEBUG \nB. FINE\nC. INFO \nD. WARN","definition":"A. DEBUG","rank":30},{"id":"4714603502","term":"What is the name for an object that enables a many-to-many relationship between two other objects?\n\nA. Parent Object\nB. Connector Object\nC. Child Object\nD. Junction Object\nE. Schema Object","definition":"D","rank":10},{"id":"8109388336","term":"What is the name of the standard relationship from Account down to Contact?\n\nA. Contacts\nB. Contact\nC. Accounts\nD. Account","definition":"A. Contacts","rank":76},{"id":"6816786334","term":"What is the preferred way of accessing web contentsuch as images, stylesheets, JavaScript, and other librariesthat is used in Visualforce pages?\n\nA. By accessing the content from Chatter Files.\nB. By uploading the content in the documents tab.\nC. By accessing the content from a third-party CDN.\nD. By uploading the content as a Static Resource.","definition":"D. By uploading the content as a Static Resource.","rank":7},{"id":"8109740907","term":"What is the preferred way to reference web content such as images, stylesheets, JavaScript, and other libraries that is used in Visualforce pages?\n\nA. Uploading the content as a Static Resource\nB. Accessing the content from a third-party CDN\nC. Uploading the content in the Documents tab\nD. Accessing the content from Chatter Files","definition":"A. Uploading the content as a Static Resource","rank":148},{"id":"8138016735","term":"What is the proper process for an Apex Unit Test\nA.\n\nQuery for test data using SeeAllData \u003d true. Call the method being tested. Verify that the results are correct.\nB.\n\nQuery for test data using SeeAllData \u003d true. Execute runAllTests(). Verify that the results are correct.\nC.\n\nCreate data for testing. Execute runAllTests(). Verify that the results are correct.\nD.\n\nCreate data for testing. Call the method being tested. Verify that the results are correct.","definition":"Create data for testing. Call the method being tested. Verify that the results are correct","rank":27},{"id":"8109686470","term":"What is the proper process for an Apex Unit Test?\n\nA. Query for test data using SeeAllData\u003dtrue. Call the method being tested. Verify that the results are correct.\nB. Query for test data using SeeAllData\u003dtruExecute runAllTests(). Verify that the results are correct.\nC. Create data for testing. Execute runAllTest(). Verify that the results are correct.\nD. Create data for testing. Call the method being tested. Verify that the results are correct.","definition":"D. Create data for testing. Call the method being tested. Verify that the results are correct.","rank":137},{"id":"8109378419","term":"What is the result of following code block ?\n\ninteger x \u003d 1;\ninteger y \u003d 0;\n\nwhile(x \u003c 10){\ny++;\n}\n\nWhat is the output :\n\nA. Error\nB. 9\nC. 0\nD. 10","definition":"A. Error","rank":73},{"id":"6824354717","term":"What is the result when a Visualforce page calls an Apex controller, which calls another Apex class, which then results in hitting a governor limit?\n\nA. Any change up to the error are saved.\nB. Any changes up to the error are rolled back.\nC. All changes before a savepoint are saved.\nD. All changes are saved in the first Apex class.","definition":"B. Any changes up to the error are rolled back.","rank":55},{"id":"8109508920","term":"What is the result when a Visualforce page calls an Apex controller, which in turn calls another Apex class, causing the code to hit a Governor Limit?\n\nA. All changes up to the error are saved.\nB. All changes before a save point are saved.\nC. All changes are saved in the first Apex class.\nD. All changes up to the error are rolled back.","definition":"D. All changes up to the error are rolled back.","rank":114},{"id":"8109395522","term":"What is the return type of a SOSL search?\n\nA. A list of sObjects.\nB. A list of AggregateResults.\nC. A list of lists of sObjects.\nD. An sObject.","definition":"C. A list of lists of sObjects.","rank":79},{"id":"8109513811","term":"What is the value of x after the code segment executes? \n\nString x \u003d \u0027A\u0027 \nInteger I \u003d 10; \nif (I \u003c 15){ \nI \u003d 15; \nx \u003d \u0027B\u0027; \n} else if ( I \u003c 20) { \nx \u003d \u0027C\u0027; \n} else { \nx \u003d \u0027D\u0027; \n}\n\nA. D\nB. A\nC. B\nD. C","definition":"C. B","rank":116},{"id":"8089130979","term":"What is true for a partial sandbox that is not true for a full sandbox? Choose 2 answers:\nA. More frequent refreshes.\nB. Only Includes necessary metadata. \nC. Use of change sets.\nD. Limited to 5 GB of data.","definition":"A. More frequent refreshes. \nD. Limited to 5 GB of data.","rank":11},{"id":"6816819306","term":"What is true of a partial sandbox that is not true of a full sandbox?\n\nA. More frequent refreshes\nB. Only includes necessary meta data\nC. Use of change sets\nD. Limited to 5 GB of data","definition":"A. More frequent refreshes\nD. Limited to 5 GB of data","rank":10},{"id":"8090437598","term":"What is true when a field update is set to re-evaluate the workflow rule? (choose three)\nA. Only workflow rules on the same object as the initial field update will be re-evaluated and triggered.\nB. Only workflow rules that didn\u0027t fire before will be retriggered.\nC. Cascade of workflow rule re-evaluation and triggering can happen up to ten times after the initial field update that started it.\nD. Any workflow rules whose criteria are met as a result of the field update will be ignored.\nE. In a batch update, workflow is only retriggered on the entities where there is a change.","definition":"A. Only workflow rules on the same object as the initial field update will be re-evaluated and triggered.\nB. Only workflow rules that didn\u0027t fire before will be retriggered.\nE. In a batch update, workflow is only retriggered on the entities where there is a change.","rank":177},{"id":"8109833557","term":"What is valid in the where clause of a SOQL query?\n\nA. A geolocation field\nB. An encrypted field\nC. An aggregate function\nD. An alias notation","definition":"A. A geolocation field\nD. An alias notation","rank":172},{"id":"8109902519","term":"What methods can be used to get a list of all sObject in an organization and their fields?\n\nA. describeObjects()\nB. describeGlobal()\nC. describeSObjects()\nD. describeSObjectFields()","definition":"B. describeGlobal()\nC. describeSObjects()","rank":183},{"id":"8090313480","term":"What must a developer consider when inserting records using an API-based tool? Choose 2\nA. Required fields on page layouts are enforced.\nB. Universally required field settings are respected. \nC. Apex triggers are ignored.\nD. Validation rules are respected","definition":"C. Apex triggers are ignored.\nD. Validation rules are respected.","rank":144},{"id":"8109528420","term":"What must the controller for a Visualforce page utilize to override the standard Opportunity view button?\n\nA. The Opportunity StandardController for pre-built functionality\nB. The StandardSetController to support related lists for pagination\nC. A constructor that initializes a private Opportunity variable\nD. A callback constructor to reference the StandardController","definition":"A. The Opportunity StandardController for pre-built functionality","rank":121},{"id":"6816746512","term":"What must the Controller for a Visulforce page utilize to override the standard Opportunity view button?\nA. The StandardSetController to support related lists for pagination\nB. The Opportunity StandardController for pre-built functionality\nC. A callback constructor to reference the StandardController\nD. A constructor that initialized a private Opportunity variable.","definition":"B. The Opportunity StandardController for pre-built functionality","rank":1},{"id":"8109678005","term":"What should a developer working in a sandbox use to exercise a new test class before the developer deploys that test class to production? Select all that apply.\n\nA. The Apex Test Execution page in Salesforce Setup\nB. The Run Tests page in Salesforce Setup\nC. The Test menu in the Developer Console\nD. The REST API and ApexTestRun method","definition":"A. The Apex Test Execution page in Salesforce Setup\nC. The Test menu in the Developer Console","rank":136},{"id":"8089707688","term":"What should a developer working in a sandbox use to exercise a new test Class before the developer deploys that test production?\nChoose 2 answers\nA. The REST API and ApexTestRun method\nB. The Apex Test Execution page in Salesforce Setup. \nC. The Test menu in the Developer Console.\nD. The Run Tests page in Salesforce Setup.","definition":"B. The Apex Test Execution page in Salesforce Setup.\nC. The Test menu in the Developer Console.","rank":23},{"id":"4714641513","term":"What should be used to prevent a user from editing the value of a field? (2 apply.)\n\nA. Field Level Security\nB. Record Types\nC. Workflow Rules\nD. Page Layouts\nE. Triggers","definition":"A, D","rank":38},{"id":"8090414599","term":"What standard Chatter actions (Post, File, Link, Poll, and Thanks) appear on the user profile page, regardless of the actions in the User page layout? (choose three)\nA. Post \nB. Poll\nC. Create \nD. File\nE. Email","definition":"A. Post \nB. Poll \nD. File","rank":169},{"id":"6826266700","term":"What statement should a developer avoid using inside procedural loops? Choose 2 answers.\n\nA. System.debug();\nB. update contactList;\nC. List\u003cContact\u003e contacts \u003d [ select id from Contact ];\nD. if(o.accountId \u003d\u003d a.id)","definition":"B. update contactList;\nC. List\u003cContact\u003e contacts \u003d [ select id from Contact ];","rank":101},{"id":"8109887777","term":"What tools you need to use to migrate Metadata to Two Different Production Orgs? (Choose 3)\n\nA. Force.Com IDE\nB. Force.Com Migration Tool\nC. Change Set\nD. Data Loader\nE. Unmanaged Package","definition":"A. Force.Com IDE\nB. Force.Com Migration Tool\nE. Unmanaged Package","rank":180},{"id":"8109482269","term":"What type of programming language is Apex? Select all that apply.\n\nA. Object-oriented\nB. On-Demand\nC. Water-Fall\nD. Declarative-Specific","definition":"A. Object-oriented\nB. On-Demand","rank":106},{"id":"6816761907","term":"What would a developer do to update a picklist field on a related Opportunity records when a modification to the associated Account record is detected?\nA. Create a process with a process builder.\nB. Create a Workflow Rule with a field update.\nC. Create a Lightning component.\nD. Create a Visualforce page.","definition":"A. Create a process with a process builder.","rank":2},{"id":"8109690337","term":"What would a developer do to update a picklist field on related Opportunity records when a modification to the associated Account record is detected?\n\nA. Create a process with Process Builder\nB. Create a workflow rule with field update\nC. Create a lightning component\nD. Create a Visualforce page","definition":"A. Create a process with Process Builder","rank":138},{"id":"4714584464","term":"When an end user hovers their mouse over the icon that appears to the right of a field, the field description appears to give the end user more information about that field.\n\nA. True\nB. False","definition":"B","rank":0},{"id":"6824351603","term":"When a number of records in a recordset is unknown, which control statement should a developer use to implement set of code that executes for every record in the recordset, without performing a .size() or .length() method call?\n\nA. For (int_stmt; exit_condition;incr_stmt) { ... }\nB. Do { .. } while(Condition)\nC. For (variable : list_or_set) {...}\nD. While (Condition) {...}","definition":"For (variable : list_or_set) {...}","rank":54},{"id":"8090387668","term":"When a user creates a record by using an object-specific create action, what feed item for that record appears? (choose three)\nA. In the Chatter feed of the user who created the record\nB. In the feed for the record on which the new record was created\nC. In the user profile feed for all users who can view the record\nD. As the first entry in the feed for the new record\nE. In the Chatter feed of the first user who follows the record on which the record was created","definition":"A. In the Chatter feed of the user who created the record\nB. In the feed for the record on which the new record was created\nD. As the first entry in the feed for the new record","rank":159},{"id":"8109329330","term":"When can a developer use a custom Visualforce page in a Force.com application? Choose 2 \n\nA. To modify the page layout settings for a custom object\nB. To create components for dashboards and layouts\nC. To deploy components between two organizations\nD. To generate a PDF document with application Data","definition":"B. To create components for dashboards and layouts\nD. To generate a PDF document with application Data","rank":61},{"id":"4714586135","term":"When creating a custom picklist field, list values are entered delimited by a comma(,).\n\nA. True\nB. False","definition":"B","rank":1},{"id":"8109818336","term":"When creating a record with a Quick Action, what is the easiest way to post a feed item?\n\nA. By selecting create case feed on the quick action.\nB. By adding a trigger on the new record.\nC. By adding a workflow rule on the new record.\nD. By selecting create case feed on the new record.","definition":"A. By selecting create case feed on the quick action.","rank":168},{"id":"8109720431","term":"When creating unit tests in Apex, Which statement is accurate?\n\nA. Unit tests with multiple methods result in all methods failing every time one method fails\nB. System Assert statements that do not increase code coverage contribute important feedback in unit(Missed)\nC. Increased test coverage requires large test classes with many lines of code in one method\nD. Triggers do not require any unit tests in order to deploy them from sandbox to production","definition":"A. Unit tests with multiple methods result in all methods failing every time one method fails","rank":143},{"id":"8109406103","term":"When does a Notification Email get sent?\n\nA. After Triggers\nB. Before Triggers\nC. After Commit\nD. Before Commit","definition":"A. After Triggers","rank":83},{"id":"4714637324","term":"When is a Cross-Object formula field calculated?\n\nA. When an update is scheduled\nB. When it is viewed\nC. When the related object record is created or updated\nD. When the record is created or updated","definition":"B","rank":34},{"id":"4714639978","term":"When is a Roll-up summary field calculated?\n\nA. When an update is scheduled\nB. When the related object record is created or updated\nC. When it is viewed\nD. When the record is created or updated","definition":"B","rank":37},{"id":"8138030784","term":"When loading data into an operation, what can a developer do to match records to update existing records? (Choose 2)\nA.\n\nMatch an auto-generated Number field to a column in the imported file.\nB.\n\nMatch an external Id Text field to a column in the imported file.\nC.\n\nMatch the Name field to a column in the imported file.\nD.\n\nMatch the Id field to a column in the imported file","definition":"Match an external Id Text field to a column in the imported file.\n\nMatch the Id field to a column in the imported file","rank":29},{"id":"8109094720","term":"When Loading data into an org, what can a developer do to match records to update existing records? (Choose 2)\n\nA. Match an external Id Text field to a column in the imported file\nB. Match the Id field to a column in the imported file\nC. Match the Name field to a column in the imported file\nD. Match an auto-generated Number field to a column in the imported file.","definition":"A. Match an external Id Text field to a column in the imported file\nB. Match the Id field to a column in the imported file","rank":28},{"id":"8089137013","term":"When loading data into an organization, what can a developer do to match records to update existing records?\nChoose 2 answers\nA. Match an external Id Text field to a column in the imported file.\nB. Match the Id field to a column in the Imported file.\nC. Match the Name field to a column in the imported file.\nD. Match an auto -generated Number field to a column in the imported file.","definition":"A. Match an external Id Text field to a column in the imported file.\nB. Match the Id field to a column in the Imported file.","rank":13},{"id":"8109391012","term":"When running an Apex test, which type of Apex syntax in tested code is counted in the code coverage calculation?\n\nA. A variable assignment.\nB. A blank line.\nC. A System.debug() statement.\nD. A comment.","definition":"A. A variable assignment.","rank":77},{"id":"8090421123","term":"When should a system administrator consider using the Salesforce AppExchange? (Choose 2)\nA. When looking for pre-built custom applications and tools\nB. When standard Salesforce functionality needs to be extended C. To find answers to Salesforce application questions\nD. To submit ideas for Salesforce application enhancements","definition":"A. When looking for pre-built custom applications and tools\nB. When standard Salesforce functionality needs to be extended","rank":172},{"id":"8090035829","term":"When the number of record in a recordset is unknown, which control statement should a developer use to implement a set of code that executes for every record in the recordset, without performing a .size() or .length() method call?\nA. For (init_stmt, exit_condition; increment_stmt) { } B. Do { } While (Condition)\nC. For (variable : list_or_set) { }\nD. While (Condition) { ... }","definition":"C. For (variable : list_or_set) { }","rank":55},{"id":"8109727968","term":"When the number of record in a recordset is unknown, which control statement should a developer use to implement a set of code that executes for every record in the recordset without performing a size() or .length() method call?\n\nA. While (Condition) {...}\nB. Do {...} While (Condition)\nC. For (init_stmt; exit_condition; increment_stmt) {...}\nD. For(Variable : list_or_set){...}","definition":"D. For(Variable : list_or_set){...}","rank":144},{"id":"8109280118","term":"When the value of a field in an account record is updated, which method will update the value of a custom field in all related opportunities? Choose 2 answers.\n\nA. A cross-object formula field on the Account object.\nB. A Workflow Rule on the Account object.\nC. A process Builder on the Account object.\nD. An Apex trigger on the Account object.","definition":"C. A process Builder on the Account object.\nD. An Apex trigger on the Account object.","rank":49},{"id":"8090127794","term":"When the value of a field in an account record is updated, which method will update the value of custom field in related opportunities?\nChoose 2 answers\nA. An Apex trigger on the Account object.\nB. A Process Builder on the Account object.\nC. A cross-object formula field on the Account object. D. A Workflow Rule on the Account object.","definition":"A. An Apex trigger on the Account obj e c t .\nB. A Process Builder on the Account object.","rank":86},{"id":"6826177321","term":"When the value of a field of an account record is updated, which method will update the value of a custom field opportunity? Choose 2 answers.\n\nA. An Apex trigger on the Account object.\nB. A process builder on the Account object.\nC. A cross-object formula field on the Account object\nD. A workflow rule on the Account object.","definition":"A. An Apex trigger on the Account object.\nB. A process builder on the Account object.","rank":87},{"id":"8109511319","term":"When would a developer use a custom controller instead of a controller extension? Select all that apply.\n\nA. When a Visualforce page needs to replace the functionality of a standard controller\nB. When a Visualforce page needs to add new actions to a standard controller\nC. When a Visualforce page does not reference a single primary object\nD. When a Visualforce page should not enforce permissions or field-level security","definition":"A. When a Visualforce page needs to replace the functionality of a standard controller\nD. When a Visualforce page should not enforce permissions or field-level security","rank":115},{"id":"6826200252","term":"Where can a custom roll-up summary field be created using standard object relationships?\n\nA. On Account using Case record\nB. On Account using Opportunity record\nC. On Opportunity using Opportunity Product record\nD. On Quote using Order record\nE. On Campaign using Campaign Member record","definition":"B. On Account using Opportunity record\nC. On Opportunity using Opportunity Product record\nE. On Campaign using Campaign Member record","rank":91},{"id":"6826291810","term":"Where can a developer call external javascript?\n\nA. \u003clink\u003e\nB. \u003capex:define\u003e\nC. \u003capex:includeScript\u003e\nD. \u003cscript\u003e","definition":"C. \u003capex:includeScript\u003e\nD. \u003cscript\u003e","rank":106},{"id":"8109042412","term":"Where can a developer call external javascript in a visualforce page. (Choose 2)\n\nA. \u003capex:indcludeScript\u003e\nB. \u003clink\u003e\nC. \u003capex:define\u003e\nD. \u003cscript\u003e","definition":"A. \u003capex:indcludeScript\u003e\nD. \u003cscript\u003e","rank":17},{"id":"8109052579","term":"Where can a developer create a managed package?\n\nA. Developer edition\nB. Enterprise edition production org\nC. Enterprise edition Sandbox org\nD. Professional edition","definition":"A. Developer edition","rank":18},{"id":"6826288036","term":"Where can a developer create managed package?\n\nA. Developer Edition\nB. Developer Sandbox\nC. Enterprise\nD. Unlimited","definition":"A. Developer Edition","rank":105},{"id":"8090137019","term":"Where can custom roll-up summary fields be created using Standard Object relationships? Choose 3 answers\nA. On Account using Case records.\nB. On Account using Opportunity records.\nC. On Opportunity using Opportunity Product records. D. On Quote using Order records.\nE. On Campaign using Campaign Member records.","definition":"E. On Campaign using Campaign Member records.\nB. On Account using Opportunity records.\nC. On Opportunity using Opportunity Product records.","rank":90},{"id":"8109265789","term":"Where can custom roll up summary fields be created using Standard object relationships?\n\nA. On Account using Opportunity records\nB. On Account using Case records\nC. On Opportunity using Opportunity Product records\nD. On Campaign using Campaign Member records.\nE. On Quote using Order records","definition":"A. On Account using Opportunity records\nC. On Opportunity using Opportunity Product records\nD. On Campaign using Campaign Member records.","rank":46},{"id":"6824437080","term":"Where can debug log filter setting be set?\n\nA. The filter link by the monitored user\u0027s name within the web UI.\nB. The Show More link on the debug log\u0027s record.\nC. On the monitored user\u0027s name.\nD. The Log Filters tab on a class or trigger detail page.","definition":"A. The filter link by the monitored user\u0027s name within the web UI.\nD. The Log Filters tab on a class or trigger detail page.","rank":70},{"id":"8109332708","term":"Where can debug log filter settings be set? Choose 2\n\nA. The Filters link by the monitored user\u0027s name within the web UI.\nB. The Show More link on the debug log\u0027s record.\nC. On the monitored user\u0027s name.\nD. The Log Filters tab on a class or trigger detail page.","definition":"A. The Filters link by the monitored user\u0027s name within the web UI.\nD. The Log Filters tab on a class or trigger detail page.","rank":62},{"id":"6924823304","term":"Where can debug log filter settings be set Choose 2 answers?\nA.The Filters link by the monitored user\u0027s name within the web UI. \nB. The Show more link on the debug log\u0027s record.\nC. On the monitored user\u0027s name.\nD. The Log Filters tab on a class or trigger detail page.","definition":"A, D","rank":123},{"id":"8137848520","term":"Where can the custom roll-up summary fields be created using Standard Object relationships (Choose 3)\nA.\n\nOn Opportunity using Opportunity Product records.\nB.\n\nOn Account using Case records.\nC.\n\nOn Quote using Order records.\nD.\n\nOn Campaign using Campaign Member records.\nE.\n\nOn Account using Opportunity records","definition":"On Opportunity using Opportunity Product records.\n\nOn Campaign using Campaign Member records.\n\nOn Account using Opportunity records","rank":18},{"id":"8137244339","term":"Where would a developer build a managed package?\nA.\n\nA. Developer Sandbox\nB.\n\nB. Unlimited Edition\nC.\n\nC. Partial Copy Sandbox\nD.\n\nD. Developer Edition","definition":"D. Developer Edition","rank":3},{"id":"8109765999","term":"Where would you find identical Force.com IDs?\n\nA. Production and Full Copy Sandbox only\nB. Production and Dev Sandbox only\nC. Two developer orgs\nD. Two Sandbox orgs","definition":"A. Production and Full Copy Sandbox only","rank":155},{"id":"8109339077","term":"Which action can a developer perform in a before update trigger? Choose 2\n\nA. Update the original object using an update DML operation\nB. Change field values using the Trigger.new context variable\nC. Display a custom error message in the application interface\nD. Delete the original object using a delete DML operation","definition":"B. Change field values using the Trigger.new context variable\nC. Display a custom error message in the application interface","rank":63},{"id":"8109364700","term":"Which Apex collection is used to ensure all values are unique?\n\nA. An sObject\nB. Set\nC. List\nD. Enum","definition":"B. Set","rank":69},{"id":"8090368873","term":"Which API cannot be used to create the data model?\nA. Force.com Single Sign-on API \nB. Force.com Metadata API\nC. AJAX Tookit for Force.com\nD. Force.com API","definition":"B. Force.com Metadata API","rank":152},{"id":"8109056235","term":"Which Base Lightning Component will display a number of buttons together in the same navigation bar?\n\nA. ui:buttons\nB. lightning:buttonGroup\nC. lightning:layout\nD. ui:navigation","definition":"B. lightning:buttonGroup","rank":19},{"id":"8109517169","term":"Which code block returns the ListView of an Account object using the following Debug statement? _x000D_system.debug(controller.getListViewOptions());_x000D_\n\nA. ApexPages.StandardSetController controller \u003d new ApexPages.StandardSetController(Database.getQueryLocator([SELECT Id FROM Account LIMIT 1]));\nB. ApexPages.StandardController controller \u003d new ApexPages.StandardController([SELECT Id FROM Account LIMIT 1]);\nC. ApexPages.StandardController controller \u003d new ApexPages.StandardController(Database.getQueryLocator([SELECT Id FROM Account LIMIT 1]));\nD. ApexPages.StandardSetController controller \u003d new ApexPages.StandardSetController([SELECT Id FROM Account LIMIT 1]);","definition":"A. ApexPages.StandardSetController controller \u003d new ApexPages.StandardSetController(Database.getQueryLocator([SELECT Id FROM Account LIMIT 1]));","rank":117},{"id":"8089817040","term":"Which code represents the Controller in MVC architecture on the Force.com platform.\nChoose 2 answers\nA. JavaScript that is used to make a menu item display itself.\nB. StandardController system methods that are referenced by Visualforce.\nC. Custom Apex and JavaScript code that is used to manipulate data. \nD. A static resource that contains CSS and Images.","definition":"B. StandardController system methods that are referenced by Visualforce.\nC. Custom Apex and JavaScript code that is used to manipulate data.","rank":42},{"id":"6824308640","term":"Which code segment can be used to control when the doWork() method is called.\n\nA. for(triggerIsRunning t : trigger.new) {\ndowork();\n}\nB. if(trigger.IsRunning) {\ndoWork();\n}\nC. for(trigger.IsInsert : trigger.new) {\ndoWork();\n}\nD. if(trigger.IsInsert) {\ndoWork();\n}","definition":"D. if(trigger.IsInsert) {\ndoWork();\n}","rank":47},{"id":"8109700255","term":"Which code segment can be used to control when the doWork() method is called?\n\nA. For(triggerIsRunning t : trigger.new){ \ndoWork();\n}\nB. For (trigger.IsInsert t : trigger.new){ \ndoWork(); \n}\nC. If(trigger.IsInsert){ \ndoWork(); \n}\nD. If(trigger.IsRunning){ \ndoWork(); \n}","definition":"C. If(trigger.IsInsert){ \ndoWork(); \n}","rank":140},{"id":"8089116247","term":"Which component is available to deploy using Metadata API? \nChoose 2 answers\n\nA. Case Layout\nB. Account Layout \nC. Case Feed Layout D. ConsoleLayout","definition":"A\nB","rank":6},{"id":"8109734390","term":"Which component is available to deploy using the Metadata API? Choose 2\n\nA. Case Layout\nB. Account Layout\nC. Console Layout\nD. Case Feed Layout","definition":"A. Case Layout\nB. Account Layout","rank":146},{"id":"8090281315","term":"Which components can be added to a lightning app on custom Object? Choose 3\nA. Standard Lightning component\nB. Custom lightning component\nC. Object specific actions on the custom object \nD. Global actions\nE. Visualforce","definition":"A. Standard Lightning component \nB. Custom lightning component \nD. Global actions","rank":135},{"id":"8108994017","term":"Which component type will display the details of the parent object from a custom lightning record for contact page?\n\nA. Related record component\nB. Parent component\nC. Hierarchy component\nD. Filter list component.","definition":"A. Related record component","rank":7},{"id":"8135652259","term":"Which Content Security Policy (CSP) configuration is required to access the Streaming API and call Apex methods from within a Lightning container component?\n\nA. CSP set to low\nB. CSP set to minimum\nC. CSP set to Lightning\nD. CSP set to custom","definition":"A. CSP set to low","rank":188},{"id":"8089695559","term":"Which data structure is returned to a developer when performing a SOSL search?\n \nA. A list of lists of sObjects.\nB. A map of sObject types to a list of sObjects\nC. A map of sObject types to a list oflists of sobjects D. a list of sObjects.","definition":"A. A list of lists of sObjects.","rank":20},{"id":"6816940966","term":"Which data structure is returned to developer when performing a SOSL search?\n\nA. A list of lists of sObjects\nB. A map of sObject types to a list of sObjects\nC. A map of sObject types to a list of lists of sObjects\nD. A list of sObjects","definition":"A. A list of lists of sObjects","rank":19},{"id":"8109344463","term":"Which data type or collection of data types can SOQL statements populate or evaluate to? Choose 3\n\nA. An Integer\nB. A single sObject\nC. A Boolean\nD. A string\nE. A list of sObjects","definition":"A. An Integer\nB. A single sObject\nE. A list of sObjects","rank":64},{"id":"8109447642","term":"Which declarative method helps ensure quality data? Choose 3\n\nA. Page layouts\nB. Validation rules\nC. Lookup filters\nD. Exception handling\nE. Workflow alerts","definition":"A. Page layouts\nB. Validation rules\nC. Lookup filters","rank":95},{"id":"8109898129","term":"Which deployment tools will you use to deploy metadata from one organization to another organization?\n\nA. Change sets\nB. Force.com IDE\nC. Unmanaged Packages","definition":"B. Force.com IDE","rank":182},{"id":"8090355076","term":"Which developer tool can be used to create a data model? (Choose 2)\nA. Force.com IDE\nB. Schema Builder\nC. Application Data Model Wizard \nD. Force.com Data Loader","definition":"A. Force.com IDE B. Schema Builder","rank":150},{"id":"8109001386","term":"Which features enables creating, updating and deleting records in other sales force orgs?\n\nA. Salesforce Connect Cross- Org Adapter.\nB. Lightning - to - Lightning Connector\nC. Database.WriteableObject Interface\nD. Apex triggers for Writeable External objects.","definition":"A. Salesforce Connect Cross- Org Adapter.","rank":9},{"id":"4714613377","term":"Which field types can be designated as an External ID?\n\nA. Phone\nB. Auto Number\nC. Email\nD. Text\nE. Number\nF. URL","definition":"C, D, E","rank":14},{"id":"6824385497","term":"Which information is provided by the Checkpoints tab in the developer console? Choose 2 answers.\n\nA. Exception\nB. Debug statement\nC. Namespace\nD. Time","definition":"C. Namespace\nD. Time","rank":60},{"id":"4714591299","term":"Which is true about encrypted custom fields? (3 apply.)\n\nA.They cannot have default values.\nB. They cannot be set as unique.\nC. They cannot be edited while encrypted.\nD. They cannot be an External ID.","definition":"A, B, D","rank":4},{"id":"8090291061","term":"Which is true about social accounts?\nA. You can use social accounts data even when you are not logged into the social account.\nB. You need a personal social account in order to see social account data\nC. You can use social accounts to import data into Salesforce\nD. Connection to social account is established through a company wide \"named principal\"","definition":"B. You need a personal social account in order to see social account data","rank":138},{"id":"8109393392","term":"Which method is defined in the StandardController class? Choose 2\n\nA. Undelete\nB. Merge\nC. Cancel\nD. Save","definition":"C. Cancel\nD. Save","rank":78},{"id":"8109089000","term":"Which new option in Winter \u002717 improves sandbox creation by reducing the data in a Full sandbox?\n\nA. Data Compression\nB. Template Optimizer\nC. Login History\nD. Content Version History","definition":"D. Content Version History","rank":26},{"id":"4714610813","term":"Which of the following are required in a Force.com custom application. (2 apply.)\n\nA. Visual Force Pages\nB. Fields\nC. Custom Object\nD. Name\nE. Ordered list of tabs","definition":"D, E","rank":12},{"id":"8109753612","term":"Which of the following can be done using the Force.com platform? Select all that apply.\n\nA. Data-warehousing\nB. Applications with clicks and not code\nC. Applications can be upgraded without loss of customization\nD. Code version control system","definition":"B. Applications with clicks and not code\nC. Applications can be upgraded without loss of customization","rank":152},{"id":"8090416572","term":"Which of the following fields are not available for record types?\nA. Opportunity Stages \nB. Case Status\nC. Solution Status\nD. Lead Status\nE. All of the above","definition":"E. All of the above","rank":170},{"id":"8109526643","term":"Which of the following is a valid Apex statement?\n\nA. Private static constant Double rate \u003d 7.75;\nB. Account() acctList \u003d new List\u003cAccount\u003e{new Account()};\nC. Integer w, x, y, \u003d 123, x \u003d abc;\nD. Map conMap \u003d [SELECT Name FROM Contact];","definition":"B. Account() acctList \u003d new List\u003cAccount\u003e{new Account()};","rank":120},{"id":"6933342585","term":"Which of the following is required when defining an Apex Class Method?\n\nA. Access Modifiers\nB. Return Data Types\nC. Definition Modifiers\nD. Input Parameters","definition":"B. Return Data Type","rank":127},{"id":"8109757155","term":"Which of the following refers to the data model of Salesforce? Select all that apply.\n\nA. Force.com API\nB. Force.com metadata API\nC. Sandbox\nD. Force.com IDE","definition":"A. Force.com API\nB. Force.com metadata API","rank":153},{"id":"4714638186","term":"Which of the following statements about Queues are true? (3 apply.)\n\nA. Sharing settings can allow other groups, roles, profiles, or users access to a Queue.\nB. Ownership of a record assigned to a Queue my be taken by any user in the queue or those above them in the role hierarchy.\nC. Queues define a pool of users that own an object.\nD. A list view is automatically created for a new Queue.\nE. Queues route requests sequentially through a pool of users.","definition":"B, C, D","rank":35},{"id":"4714627097","term":"Which of the following statements about Validation Rules are true? (3 apply.)\n\nA. Error messages can be displayed below the field or at the top of the page.\nB. They can modify the field value before it is saved.\nC. They can contain a formula or expression that evaluates other fields.\nD. They can trigger a workflow to execute.\nE. They verify data a user enters before the record is saved.","definition":"E, C, E","rank":27},{"id":"8109760368","term":"Which of the following will you use for browsing objects and fields in the Force.com IDE? Select all that apply.\n\nA. Force.com Projects\nB. Schema Explorer\nC. Development Work Area\nD. Debug View","definition":"B. Schema Explorer","rank":154},{"id":"8109467225","term":"Which of these is a characteristic of the Lightning Component framework? Select all that apply.\n\nA. It has an event-driven architecture.\nB. It works with the existing Visualforce pages.\nC. It uses XML as its data format.\nD. It includes responsive components.","definition":"A. It has an event-driven architecture.\nD. It includes responsive components.","rank":101},{"id":"8109488600","term":"Which of these statements are true about the \"view state\" inspector? Select all that apply.\n\nA. Shows components contributing to view state\nB. Must be enabled on a user profile\nC. Is displayed only when using \u003capex: form\u003e\nD. Is controlled by the Role Hierarchy","definition":"A. Shows components contributing to view state\nB. Must be enabled on a user profile\nC. Is displayed only when using \u003capex: form\u003e","rank":108},{"id":"8109561923","term":"Which of these statements is true for encrypted custom fields? Select all that apply.\n\nA. Encrypted fields can be included in Search results.\nB. Encrypted fields can be included in report results.\nC. Encrypted fields are not available in filters for list views, reports, and Roll-up summary fields.\nD. Encrypted fields are not available for validation rules or Apex scripts.","definition":"A. Encrypted fields can be included in Search results.\nB. Encrypted fields can be included in report results.\nC. Encrypted fields are not available in filters for list views, reports, and Roll-up summary fields.","rank":132},{"id":"8109565634","term":"Which one of the following is not possible to view in the Debug Logs?\n\nA. Workflow formula evaluation results\nB. Assignment rules\nC. Formula field calculations\nD. Validation rules\nE. Resources used by Apex Script","definition":"A. Workflow formula evaluation results\nC. Formula field calculations\nE. Resources used by Apex Script","rank":133},{"id":"8090377480","term":"Which permission is required to install and uninstall packages from Salesforce AppExchange?\nA. Manage Package Licenses\nB. Upload AppExchange Packages\nC. Download AppExchange Packages \nD. Create AppExchange Packages","definition":"C. Download AppExchange Packages","rank":155},{"id":"8090311159","term":"Which portion of the Model-View-Controller paradigm is represented in Force.com as a standard\nor custom object?\nA. Model\nB. Controller \nC. View","definition":"A. Model","rank":143},{"id":"8109436213","term":"Which requirement needs to be implemented by using standard workflow instead of Process Builder? Choose 2\n\nA. Create activities at multiple intervals.\nB. Send an outbound message without Apex code.\nC. Copy an account address to its contacts.\nD. Submit a contract for approval.","definition":"A. Create activities at multiple intervals.\nB. Send an outbound message without Apex code.","rank":91},{"id":"6816768081","term":"Which requirement needs to be implemented using standard workflow instead of Process Builder? Choose 2 answers\nA. Create activities at multiple intervals\nB. Send outbound message without Apex code\nC. Copy an account address to its contacts\nD. Submit a contract for approval","definition":"A. Create activities at multiple intervals\nB. Send outbound message without Apex code","rank":3},{"id":"8109705848","term":"Which resource can be included in a Lightning Component bundle? Choose 2\n\nA. Apex class\nB. Documentation\nC. JavaScript\nD. Adobe Flash","definition":"B. Documentation\nC. JavaScript","rank":141},{"id":"6817009540","term":"Which resources can be included in a Lightning Component bundle?\n\nA. Apex class\nB. Adobe Flash\nC. Javascript\nD. Documentation","definition":"C. Javascript\nD. Documentation","rank":33},{"id":"8109267421","term":"Which scenario is invalid for executing by unit tests?\n\nA. Executing methods for negative test scenarios.\nB. Executing methods as different users.\nC. Loading test data in place of user input for Flows.\nD. Load the standard Pricebook ID using a system method.","definition":"C. Loading test data in place of user input for Flows.","rank":47},{"id":"8090131687","term":"Which scenario is invalid for execution by unit tests.\nA. Executing methods for negative test scenario.\nB. Executing methods as different users.\nC. Loading test data in place of user input for Flows.\nD. Load the standard Pricebook ID using a system method.","definition":"C. Loading test data in place of user input for Flows.","rank":88},{"id":"6826188708","term":"Which scenario is invalid for execution by unit tests?\n\nA. Executing methods for negative test scenarios.\nB. Executing methods as different users.\nC. Loading test data in place of user input for flows.\nD. Loading the standard Pricebook ID using a system method.","definition":"C. Loading test data in place of user input for flows.","rank":89},{"id":"8090384635","term":"Which social networks are available in the Lightning Experience and Salesforce1?\nA. Klout\nB. Facebook \nC. LinkedIn \nD. Twitter","definition":"D. Twitter","rank":158},{"id":"8108966786","term":"Which standard actions can be overridden with Lightning Components?\n\nA. List, Edit, New, Delete\nB. Tab, View, Edit, New\nC. View, Edit, New, Delete\nD. List, View, Edit, New","definition":"B. Tab, View, Edit, New","rank":2},{"id":"8109460820","term":"Which standard field mandatorily needs to be populated when a developer inserts new Contact records programmatically?\n\nA. Name\nB. LastName\nC. AccountId\nD. FirstName","definition":"B. LastName","rank":99},{"id":"6816976326","term":"Which standard field needs to be populated when a developer inserts a new Contact records programmatically?\n\nA. AccountId\nB. Name\nC. LastName\nD. FirstName","definition":"C. LastName","rank":27},{"id":"8089734038","term":"Which standard field needs to be populated when a developer inserts new Contact records programmatically?\nA. Accountld \nB. Name\nC. LastName \nD. FirstName","definition":"C. LastName","rank":28},{"id":"4714589271","term":"Which standard fields are added when a custom object is created? (3 apply)\n\nA. ID\nB. Description\nC. Last Modified By\nD. Name\nE. Type","definition":"A, C, D","rank":3},{"id":"8109294224","term":"Which statement about change set deployment is accurate? (Choose 3)\n\nA. They require a deployment connection\nB. They can be used to deploy custom settings data\nC. They can be used to transfer Contact records\nD. They use an all or none deployment model\nE. They can be used only between related organizations","definition":"A. They require a deployment connection\nD. They use an all or none deployment model\nE. They can be used only between related organizations","rank":52},{"id":"6826158418","term":"Which statement about change set deployments is accurate?\nChoose 3 answers\n\nA. They can be used only between related organizations.\nB. They require a deployment connection.\nC. They use an all or none deployment model.\nD. They can be used to transfer Contact records.\nE. They can be used to deploy custom settings data.","definition":"A. They can be used only between related organizations.\nB. They require a deployment connection.\nC. They use an all or none deployment model.","rank":83},{"id":"8109381956","term":"Which statement about declarations is correct?\n\nA. A developer can extend a class that is declared with Virtual keyword\nB. A developer can\u0027t use class or method using final keyword\nC. A developer can define constant with final keyword.","definition":"A. A developer can extend a class that is declared with Virtual keyword\nB. A developer can\u0027t use class or method using final keyword\nC. A developer can define constant with final keyword.","rank":74},{"id":"8090411517","term":"Which statement about record types is true? (select 2)\nA. The ability to create records of a specific record type is determined by the profile B. Users cannot view records assigned to a record type their profile does not have access to\nC. Record types can be used to define picklist values available for a given field\nD. Record types can only be assigned to one profile at a time","definition":"A. The ability to create records of a specific record type is determined by the profile\nC. Record types can be used to define picklist values available for a given field","rank":168},{"id":"8109323113","term":"Which statement about the lookup relationship between a custom object and a standard object is correct?\n\nA. The Custom Object will be deleted when the referenced Standard Object is deleted\nB. The lookup Relationship cannot be marked as required on the page layout for the Custom Object\nC. The custom Object inherits security from the referenced Standard Object\nD. The Lookup relationship on the Custom Object can prevent the deletion of the Standard Object","definition":"D. The Lookup relationship on the Custom Object can prevent the deletion of the Standard Object","rank":60},{"id":"6826081784","term":"Which statements about the Lookup Relationship between a Custom Object and a Standard Object is correct?\n\nA. The Lookup Relationship on the Custom Object can prevent the deletion of the Standard Object.\nB. The Lookup Relationship cannot be marked as required on the page layout for a custom object.\nC. The Custom Object will be deleted when the referenced Standard Object is deleted.\nD. The Custom Object inherits security from the referenced Standard Object","definition":"A. The Lookup Relationship on the Custom Object can prevent the deletion of the Standard Object.","rank":73},{"id":"4714597336","term":"Which statements are true about Master-Detail relationships. (3 apply.)\n\nA. Can be multiple layers deep\nB. The Parent field on child is required\nC. Up to 25 allowed per object\nD. Access to parent determines access to children\nE. The Lookup field on page layout is required","definition":"B, D, E","rank":7},{"id":"8090274106","term":"Which statements are true regarding Roll-Up Summary fields? Select all that apply\nA. Advanced currency management has no affect on roll-up summary fields.\nB. Because roll-up summary fields are not displayed on edit pages, you can use them in validation rules but not as the error location for you validation.\nC. Validation errors can display when saving either the detail or master record.\nD. Automatically derived fields, such as current date or current user, are allowed in a roll-up summary field.\nE. Once created, you cannot change the detail object selected or delete any field referenced in your roll-up summary definition.","definition":"B. Because roll-up summary fields are not displayed on edit pages, you can use them in validation rules but not as the error location for you validation.\nC. Validation errors can display when saving either the detail or master record.\nE. Once created, you cannot change the detail object selected or delete any field referenced in your roll-up summary definition.","rank":133},{"id":"8109130499","term":"Which statement should a developer avoid using inside Procedural loops? (Choose 2)\n\nA. If(o.accountid \u003d a.id)\nB. System.debug(\u0027Amount of CPU time (in ms) used so far:\u0027 + Limits.getCpuTime());\nC. Update contactList\nD. List contacts \u003d [select id, salutation, firstname, lastname, email from Contact where accountId \u003d :a.Id]","definition":"C. Update contactList\nD. List contacts \u003d [select id, salutation, firstname, lastname, email from Contact where accountId \u003d :a.Id]","rank":36},{"id":"8109126627","term":"Which statement would a developer use when creating test data for products and pricebooks?\n\nA. List objList\u003d Test.loadData(Acccount.sObjectType, \u0027,myResource\u0027);\nB. IsTest(SeeAllData\u003dfalse)\nC. Pricebook pb \u003d new pricebook();\nD. Id pricebookId \u003d Test.getStandardPricebookId();","definition":"D. Id pricebookId \u003d Test.getStandardPricebookId();","rank":35},{"id":"8109014461","term":"Which three actions can be taken from the Global Action Menu?\n\nA. Launch a custom visual force page\nB. Launch a custom Canvas App\nC. Launch a custom lightning Component\nD. Post a chatter feed\nE. Execute anonymous blocks of Apex code","definition":"A. Launch a custom visual force page\nB. Launch a custom Canvas App\nC. Launch a custom lightning Component","rank":11},{"id":"8109034645","term":"Which three Metadata components can be deployed via Change Sets?\n\nA. Lightning Application\nB. Wave Application\nC. Global Picklist\nD. Wave Dashboard\nE. Lightning Component","definition":"A. Lightning Application\nC. Global Picklist\nE. Lightning Component","rank":15},{"id":"8108991603","term":"Which three types of content can shortcut be created for using favorites?\n\nA. Chatter group\nB. Record home pages\nC. Dashboard\nD. Custom tabs\nE. Global actions","definition":"A. Chatter group\nB. Record home pages\nC. Dashboard","rank":6},{"id":"6922385670","term":"Which three use case requires a partial copy or full sandbox?\nChoose three answers\nA. Scalability Testing\nB. Development Testing\nC. Quality Assurance Testing\nD. Batch Data Testing\nE. Integration Testing","definition":"A, D, E","rank":108},{"id":"8090219747","term":"Which trigger event allows a developer to update fields in the Trigger.new list without using an additional DML statement? (Choose 2)\nA. After update. \nB. Before insert. \nC. Before update. \nD. After insert.","definition":"B. Before insert. \nC. Before update.","rank":115},{"id":"8109788837","term":"Which trigger event allows a developer to update fields in the Trigger.new list without using an aditional DML statement? Choose 2\n\nA. After insert.\nB. After update.\nC. Before insert.\nD. Before update.","definition":"C. Before insert.\nD. Before update.","rank":160},{"id":"6922402371","term":"Which two are valid in the where clause of a SOQL query?\nChoose two answers\nA. A geolocation field.\nB. An encrypted field.\nC. An aggregate function.\nD. An alias notation.","definition":"A, D","rank":111},{"id":"8109040237","term":"Which two features can be used to prevent values from being selected in a picklist?\n\nA. Validation Rules\nB. Workflow Rules\nC. Restricted Picklists\nD. Filtered Picklists\nE. Validated Picklists","definition":"A. Validation Rules\nC. Restricted Picklists","rank":16},{"id":"8109063099","term":"Which two interfaces can be implemented to enable a Lightning component for Custom Actions? (Choose 2 answers)\n\nA. aura:enableQuickAction\nB. lightning:quickActionEnabled\nC. force:lightningQuickActionWithoutHeader\nD. force:lightningQuickAction\nE. force:lightningQuickActionWithHeader","definition":"C. force:lightningQuickActionWithoutHeader\nD. force:lightningQuickAction","rank":20},{"id":"8109018829","term":"Which two objects can be queried with SOQL? (Select ONE)\n\nA. DashboardSchedule\nB. DashboardRefresh\nC. DashboardComponent\nD. LightningComponent","definition":"C. DashboardComponent","rank":12},{"id":"8109010197","term":"Which two options are available to display detailed information about the status of and apex batch job?\n\nA. Heap size\nB. Submitted date\nC. Elapsed time\nD. Submitted by user","definition":"B. Submitted date\nC. Elapsed time","rank":10},{"id":"8135649436","term":"Which two statements are true regarding Lightning component JavaScript code validation? Choose 2\n\nA. Code validations can be temporarily disabled by setting the component version to API 40.0 or earlier.\nB. Code validations enforce all ESlint rules.\nC. Code validations are applied only to components set to API version 41.0 and later.\nD. The validation service ensures good software design and prevent bugs.","definition":"A. Code validations can be temporarily disabled by setting the component version to API 40.0 or earlier.\n\nC. Code validations are applied only to components set to API version 41.0 and later.","rank":185},{"id":"6924773440","term":"Which type of code represents the Controller in MVC architecture on the Force.com platform? Choose 2 answers\n\nA.JavaScript that is used to make a menu item display itself.\nB. StandardController system methods that are referenced by Visualforce.\nC. Custom Apex and JavaScript code that is used to manipulate data. \nD. A static resource that contains CSS and images.","definition":"B, C","rank":117},{"id":"8109801353","term":"Which type of code represent the Controller in MVC architecture on the Force.com platform? Choose 2 answers\n\nA. A static resouce that cntains CSS and images\nB. JavaScript that is used to make a menu item display itself\nC. StandardController system methods that are refenced by VisualForce\nD. Custom Apex and Javascript code that is used to manipulate data","definition":"C. StandardController system methods that are refenced by VisualForce\nD. Custom Apex and Javascript code that is used to manipulate data","rank":163},{"id":"8109356019","term":"Which type of information is provided by the Checkpoints tab in the Developer console? Choose 2\n\nA. Namespace\nB. Debug Statement\nC. Time\nD. Exception","definition":"A. Namespace\nC. Time","rank":66},{"id":"8109843794","term":"Which use case requires a partial copy or full sandbox?\n\nA. Scalability Testing\nB. Development Testing\nC. Quality Assurance Testing\nD. Batch Data Testing\nE. Integration Testing","definition":"A. Scalability Testing\nD. Batch Data Testing\nE. Integration Testing","rank":175},{"id":"8109359220","term":"Which user can edit a record after it has been locked for approval? Choose 2\n\nA. Any user with a higher role in the hierarchy\nB. An administrator\nC. Any user who approved the record previously\nD. An user who is assigned as the current approver","definition":"B. An administrator\nD. An user who is assigned as the current approver","rank":67},{"id":"8109120612","term":"Why would a developer use Test.startTest() and Test.stopTest()?\n\nA. To avoid Apex code coverage requirements for the code between these lines.\nB. To start and stop anonymous block execution when executing anonymous Apex code\nC. To indicate test code so that it does not impact Apex line count governor limits\nD. To create an additional set of governor limits during the execution of a single test class","definition":"D. To create an additional set of governor limits during the execution of a single test class","rank":33},{"id":"4714634649","term":"You are setting up a profile to be used with integration software. Which profile permissions should this profile have? (3 apply.)\nA. Manage Data Categories\nB. API Only User\nC. Customize Application\nD. Manage Users\nE. Modify All Data\nF. Password Never Expires","definition":"B, E, F","rank":33},{"id":"8090389938","term":"You can create global actions to let users create which of the following records? (choose three)\nA. Question\nB. Chatter Posts\nC. Event (without invitees) D. Opportunity\nE. Users","definition":"A. Question\nC. Event (without invitees) \nD. Opportunity","rank":160},{"id":"4714587018","term":"You have created an application to track expenses. It is mandatory that a reason field be entered for each expense item. What are ways this could be accomplished? (3 apply.)\n\nA. Created a workflow rule\nB. Check the Required field box on the page layout\nC. Check the Required field box on the field definition\nD. Check the Required field box for the field on the Record Type definition\nE. Created a validation rule for the field","definition":"B, C, E","rank":2},{"id":"8090431299","term":"You have created a workflow rule to send an email in your configuration sandbox. For some reason it\u0027s not working, what should you double check? (Choose 2)\nA. You have the correct email address\nB. Look at the system audit trail\nC. Check the deliverability settings\nD. HTML does not work in sandbox, make sure your email has no HTML","definition":"A. You have the correct email address\nC. Check the deliverability settings","rank":175},{"id":"8109858764","term":"You want to use an External Data Object Table from Heroku carrying Product Category information. The data need to be included in Salesforce and searchable. What do you have to do before you can use the connection? Choose 2\n\nA. Choose \"include as index field\"\nB. Press \"validate and sync\"\nC. Choose \"include in Salesforce searches\" option\nD. URL / choose the URL (?)","definition":"B. Press \"validate and sync\"\nC. Choose \"include in Salesforce searches\" option","rank":177}]}